{
    "dataset": {
        "id": "coypu-kg-questions-train"
    },
    "questions": [
        {
            "id": "1444",
            "question": [
                {
                    "string": "Which occurrences included chemical weapons since 2019?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) >= 2019 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1445",
            "question": [
                {
                    "string": "What cases involved chemical weapons since 2016?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) >= 2016 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1446",
            "question": [
                {
                    "string": "Which incidents experienced chemical weapons since 2021?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) >= 2021 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1447",
            "question": [
                {
                    "string": "What occurrences encountered chemical weapons since 2018?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) >= 2018 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1448",
            "question": [
                {
                    "string": "Which situations faced chemical weapons since 2017?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) >= 2017 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1449",
            "question": [
                {
                    "string": "What events witnessed chemical weapons since 2016?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) >= 2016 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1450",
            "question": [
                {
                    "string": "Which incidents endured chemical weapons since 2020?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) >= 2020 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1451",
            "question": [
                {
                    "string": "What occurrences saw chemical weapons since 2019?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) >= 2019 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1452",
            "question": [
                {
                    "string": "Which situations included chemical weapons since 2018?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) >= 2018 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1453",
            "question": [
                {
                    "string": "What events experienced chemical weapons since 2017?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) >= 2017 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1454",
            "question": [
                {
                    "string": "How many interventions against China are currently active?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"China\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1455",
            "question": [
                {
                    "string": "What is the count of interventions against Brazil that are currently active?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"Brazil\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1456",
            "question": [
                {
                    "string": "How many interventions targeting France are currently active?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"France\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1457",
            "question": [
                {
                    "string": "What is the total number of interventions against Japan that are currently active?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"Japan\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1458",
            "question": [
                {
                    "string": "How many interventions aimed at Germany are currently active?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"Germany\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1459",
            "question": [
                {
                    "string": "What is the count of interventions against Iran that are currently active?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"Iran\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1460",
            "question": [
                {
                    "string": "How many interventions related to Australia are currently active?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"Australia\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1461",
            "question": [
                {
                    "string": "What is the total number of interventions against India that are currently active?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"India\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1462",
            "question": [
                {
                    "string": "How many interventions concerning Turkey are currently active?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"Turkey\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1463",
            "question": [
                {
                    "string": "What is the count of interventions against South Korea that are currently active?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"South Korea\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1464",
            "question": [
                {
                    "string": "How many interventions involving Canada are currently active?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"Canada\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1465",
            "question": [
                {
                    "string": "What is the total number of interventions against Mexico that are currently active?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"Mexico\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1466",
            "question": [
                {
                    "string": "How many interventions aimed at Italy are currently active?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"Italy\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1467",
            "question": [
                {
                    "string": "What is the count of interventions against Spain that are currently active?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"Spain\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1468",
            "question": [
                {
                    "string": "How many interventions related to the United Kingdom are currently active?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"United Kingdom\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1469",
            "question": [
                {
                    "string": "What is the total number of interventions against Argentina that are currently active?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"Argentina\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1470",
            "question": [
                {
                    "string": "How many interventions concerning Egypt are currently active?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"Egypt\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1471",
            "question": [
                {
                    "string": "What is the count of interventions against Saudi Arabia that are currently active?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"Saudi Arabia\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1472",
            "question": [
                {
                    "string": "How many interventions involving Indonesia are currently active?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"Indonesia\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1473",
            "question": [
                {
                    "string": "What is the total number of interventions against Nigeria that are currently active?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"Nigeria\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1474",
            "question": [
                {
                    "string": "What is Germany's most recent intervention against China?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"China\"@en . ?var_1 gta:hasImplementingJurisdiction / rdfs:label \"Germany\"@en . ?var_1 gta:hasImplementationDate ?var_2 . } order by desc ( ?var_2 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1475",
            "question": [
                {
                    "string": "Which is France's most recent intervention against Brazil?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"Brazil\"@en . ?var_1 gta:hasImplementingJurisdiction / rdfs:label \"France\"@en . ?var_1 gta:hasImplementationDate ?var_2 . } order by desc ( ?var_2 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1476",
            "question": [
                {
                    "string": "What is Japan's most recent intervention against France?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"France\"@en . ?var_1 gta:hasImplementingJurisdiction / rdfs:label \"Japan\"@en . ?var_1 gta:hasImplementationDate ?var_2 . } order by desc ( ?var_2 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1477",
            "question": [
                {
                    "string": "Which is Brazil's most recent intervention against Japan?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"Japan\"@en . ?var_1 gta:hasImplementingJurisdiction / rdfs:label \"Brazil\"@en . ?var_1 gta:hasImplementationDate ?var_2 . } order by desc ( ?var_2 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1478",
            "question": [
                {
                    "string": "What is Russia's most recent intervention against Germany?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"Germany\"@en . ?var_1 gta:hasImplementingJurisdiction / rdfs:label \"Russia\"@en . ?var_1 gta:hasImplementationDate ?var_2 . } order by desc ( ?var_2 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1479",
            "question": [
                {
                    "string": "Which is China's most recent intervention against Russia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"Russia\"@en . ?var_1 gta:hasImplementingJurisdiction / rdfs:label \"China\"@en . ?var_1 gta:hasImplementationDate ?var_2 . } order by desc ( ?var_2 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1480",
            "question": [
                {
                    "string": "What is Australia's most recent intervention against Brazil?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"Brazil\"@en . ?var_1 gta:hasImplementingJurisdiction / rdfs:label \"Australia\"@en . ?var_1 gta:hasImplementationDate ?var_2 . } order by desc ( ?var_2 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1481",
            "question": [
                {
                    "string": "Which is France's most recent intervention against China?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type gta:Intervention . ?var_1 gta:hasAffectedJurisdiction / rdfs:label \"China\"@en . ?var_1 gta:hasImplementingJurisdiction / rdfs:label \"France\"@en . ?var_1 gta:hasImplementationDate ?var_2 . } order by desc ( ?var_2 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1493",
            "question": [
                {
                    "string": "Which products are impacted by intervention 204863?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type gta:Intervention . ?var_2 gta:hasInterventionId \"204863\" . ?var_2 gta:hasAffectedProduct ?var_1 }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1494",
            "question": [
                {
                    "string": "What items are influenced by intervention 309742?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type gta:Intervention . ?var_2 gta:hasInterventionId \"309742\" . ?var_2 gta:hasAffectedProduct ?var_1 }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1495",
            "question": [
                {
                    "string": "Which goods are affected by intervention 551980?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type gta:Intervention . ?var_2 gta:hasInterventionId \"551980\" . ?var_2 gta:hasAffectedProduct ?var_1 }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1496",
            "question": [
                {
                    "string": "What commodities are impacted by intervention 702401?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type gta:Intervention . ?var_2 gta:hasInterventionId \"702401\" . ?var_2 gta:hasAffectedProduct ?var_1 }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1497",
            "question": [
                {
                    "string": "Which articles are influenced by intervention 854320?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type gta:Intervention . ?var_2 gta:hasInterventionId \"854320\" . ?var_2 gta:hasAffectedProduct ?var_1 }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1498",
            "question": [
                {
                    "string": "What merchandise are affected by intervention 103847?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type gta:Intervention . ?var_2 gta:hasInterventionId \"103847\" . ?var_2 gta:hasAffectedProduct ?var_1 }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1499",
            "question": [
                {
                    "string": "Which items are impacted by intervention 204954?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type gta:Intervention . ?var_2 gta:hasInterventionId \"204954\" . ?var_2 gta:hasAffectedProduct ?var_1 }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1500",
            "question": [
                {
                    "string": "What products are influenced by intervention 309563?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type gta:Intervention . ?var_2 gta:hasInterventionId \"309563\" . ?var_2 gta:hasAffectedProduct ?var_1 }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1501",
            "question": [
                {
                    "string": "Which goods are affected by intervention 551882?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type gta:Intervention . ?var_2 gta:hasInterventionId \"551882\" . ?var_2 gta:hasAffectedProduct ?var_1 }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1502",
            "question": [
                {
                    "string": "What commodities are impacted by intervention 702514?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type gta:Intervention . ?var_2 gta:hasInterventionId \"702514\" . ?var_2 gta:hasAffectedProduct ?var_1 }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1503",
            "question": [
                {
                    "string": "Which articles are influenced by intervention 854239?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type gta:Intervention . ?var_2 gta:hasInterventionId \"854239\" . ?var_2 gta:hasAffectedProduct ?var_1 }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1504",
            "question": [
                {
                    "string": "What merchandise are affected by intervention 103786?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type gta:Intervention . ?var_2 gta:hasInterventionId \"103786\" . ?var_2 gta:hasAffectedProduct ?var_1 }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1505",
            "question": [
                {
                    "string": "Which items are impacted by intervention 204893?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type gta:Intervention . ?var_2 gta:hasInterventionId \"204893\" . ?var_2 gta:hasAffectedProduct ?var_1 }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1506",
            "question": [
                {
                    "string": "What products are influenced by intervention 309624?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type gta:Intervention . ?var_2 gta:hasInterventionId \"309624\" . ?var_2 gta:hasAffectedProduct ?var_1 }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1507",
            "question": [
                {
                    "string": "Which goods are affected by intervention 551927?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type gta:Intervention . ?var_2 gta:hasInterventionId \"551927\" . ?var_2 gta:hasAffectedProduct ?var_1 }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1508",
            "question": [
                {
                    "string": "What commodities are influenced by intervention 702468?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type gta:Intervention . ?var_2 gta:hasInterventionId \"702468\" . ?var_2 gta:hasAffectedProduct ?var_1 }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1509",
            "question": [
                {
                    "string": "Which articles are impacted by intervention 854361?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type gta:Intervention . ?var_2 gta:hasInterventionId \"854361\" . ?var_2 gta:hasAffectedProduct ?var_1 }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1510",
            "question": [
                {
                    "string": "What merchandise are influenced by intervention 103801?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type gta:Intervention . ?var_2 gta:hasInterventionId \"103801\" . ?var_2 gta:hasAffectedProduct ?var_1 }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1511",
            "question": [
                {
                    "string": "Which items are impacted by intervention 204936?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type gta:Intervention . ?var_2 gta:hasInterventionId \"204936\" . ?var_2 gta:hasAffectedProduct ?var_1 }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1512",
            "question": [
                {
                    "string": "What products are influenced by intervention 309585?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type gta:Intervention . ?var_2 gta:hasInterventionId \"309585\" . ?var_2 gta:hasAffectedProduct ?var_1 }"
            },
            "answers": [
                ""
            ]
        }
    ]
}