{
    "dataset": {
        "id": "coypu-kg-questions-train"
    },
    "questions": [
        {
            "id": "1323",
            "question": [
                {
                    "string": "How many cases took place in New York in 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Attack . ?var_1 coy:hasLocation 'New York' . ?var_1 coy:hasTimestamp ?var_3 . filter ( year ( ?var_3 ) = 2022 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1324",
            "question": [
                {
                    "string": "How many situations happened in Tokyo in 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Attack . ?var_1 coy:hasLocation 'Tokyo' . ?var_1 coy:hasTimestamp ?var_3 . filter ( year ( ?var_3 ) = 2022 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1325",
            "question": [
                {
                    "string": "How many incidents occurred in Rome in 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Attack . ?var_1 coy:hasLocation 'Rome' . ?var_1 coy:hasTimestamp ?var_3 . filter ( year ( ?var_3 ) = 2022 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1326",
            "question": [
                {
                    "string": "How many events took place in Sydney in 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Attack . ?var_1 coy:hasLocation 'Sydney' . ?var_1 coy:hasTimestamp ?var_3 . filter ( year ( ?var_3 ) = 2022 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1327",
            "question": [
                {
                    "string": "How many occurrences happened in Beijing in 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Attack . ?var_1 coy:hasLocation 'Beijing' . ?var_1 coy:hasTimestamp ?var_3 . filter ( year ( ?var_3 ) = 2022 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1328",
            "question": [
                {
                    "string": "How many instances occurred in Cairo in 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Attack . ?var_1 coy:hasLocation 'Cairo' . ?var_1 coy:hasTimestamp ?var_3 . filter ( year ( ?var_3 ) = 2022 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1329",
            "question": [
                {
                    "string": "How many cases took place in Toronto in 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Attack . ?var_1 coy:hasLocation 'Toronto' . ?var_1 coy:hasTimestamp ?var_3 . filter ( year ( ?var_3 ) = 2022 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1330",
            "question": [
                {
                    "string": "How many situations happened in Berlin in 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Attack . ?var_1 coy:hasLocation 'Berlin' . ?var_1 coy:hasTimestamp ?var_3 . filter ( year ( ?var_3 ) = 2022 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1331",
            "question": [
                {
                    "string": "How many incidents occurred in Madrid in 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Attack . ?var_1 coy:hasLocation 'Madrid' . ?var_1 coy:hasTimestamp ?var_3 . filter ( year ( ?var_3 ) = 2022 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1332",
            "question": [
                {
                    "string": "How many events took place in Jakarta in 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Attack . ?var_1 coy:hasLocation 'Jakarta' . ?var_1 coy:hasTimestamp ?var_3 . filter ( year ( ?var_3 ) = 2022 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1333",
            "question": [
                {
                    "string": "How many occurrences happened in Bangkok in 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Attack . ?var_1 coy:hasLocation 'Bangkok' . ?var_1 coy:hasTimestamp ?var_3 . filter ( year ( ?var_3 ) = 2022 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1334",
            "question": [
                {
                    "string": "How many instances occurred in Singapore in 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Attack . ?var_1 coy:hasLocation 'Singapore' . ?var_1 coy:hasTimestamp ?var_3 . filter ( year ( ?var_3 ) = 2022 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1335",
            "question": [
                {
                    "string": "How many cases took place in Rome in 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Attack . ?var_1 coy:hasLocation 'Rome' . ?var_1 coy:hasTimestamp ?var_3 . filter ( year ( ?var_3 ) = 2022 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1336",
            "question": [
                {
                    "string": "How many situations happened in Seoul in 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Attack . ?var_1 coy:hasLocation 'Seoul' . ?var_1 coy:hasTimestamp ?var_3 . filter ( year ( ?var_3 ) = 2022 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1337",
            "question": [
                {
                    "string": "How many incidents occurred in Mumbai in 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Attack . ?var_1 coy:hasLocation 'Mumbai' . ?var_1 coy:hasTimestamp ?var_3 . filter ( year ( ?var_3 ) = 2022 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1338",
            "question": [
                {
                    "string": "Was Baghdad attacked in 2020?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:Conflict . ?var_1 coy:hasLocation 'Baghdad' . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2020 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1339",
            "question": [
                {
                    "string": "Was Kabul attacked in 2020?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:Conflict . ?var_1 coy:hasLocation 'Kabul' . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2020 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1340",
            "question": [
                {
                    "string": "Was Tripoli attacked in 2020?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:Conflict . ?var_1 coy:hasLocation 'Tripoli' . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2020 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1341",
            "question": [
                {
                    "string": "Was Mosul attacked in 2020?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:Conflict . ?var_1 coy:hasLocation 'Mosul' . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2020 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1342",
            "question": [
                {
                    "string": "Was Aleppo attacked in 2020?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:Conflict . ?var_1 coy:hasLocation 'Aleppo' . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2020 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1343",
            "question": [
                {
                    "string": "Was Sana'a attacked in 2020?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:Conflict . ?var_1 coy:hasLocation 'Sana'a' . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2020 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1344",
            "question": [
                {
                    "string": "Was Homs attacked in 2020?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:Conflict . ?var_1 coy:hasLocation 'Homs' . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2020 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1345",
            "question": [
                {
                    "string": "Was Raqqa attacked in 2020?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:Conflict . ?var_1 coy:hasLocation 'Raqqa' . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2020 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1346",
            "question": [
                {
                    "string": "Was Aden attacked in 2020?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:Conflict . ?var_1 coy:hasLocation 'Aden' . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2020 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1348",
            "question": [
                {
                    "string": "Was Tikrit attacked in 2020?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:Conflict . ?var_1 coy:hasLocation 'Tikrit' . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2020 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1349",
            "question": [
                {
                    "string": "Was Misrata attacked in 2020?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:Conflict . ?var_1 coy:hasLocation 'Misrata' . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2020 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1350",
            "question": [
                {
                    "string": "Was Basra attacked in 2020?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:Conflict . ?var_1 coy:hasLocation 'Basra' . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2020 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1351",
            "question": [
                {
                    "string": "Was Benghazi attacked in 2020?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:Conflict . ?var_1 coy:hasLocation 'Benghazi' . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2020 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1352",
            "question": [
                {
                    "string": "Was Najaf attacked in 2020?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:Conflict . ?var_1 coy:hasLocation 'Najaf' . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2020 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1353",
            "question": [
                {
                    "string": "Was Taiz attacked in 2020?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:Conflict . ?var_1 coy:hasLocation 'Taiz' . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2020 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1354",
            "question": [
                {
                    "string": "Was Ramadi attacked in 2020?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:Conflict . ?var_1 coy:hasLocation 'Ramadi' . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2020 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1355",
            "question": [
                {
                    "string": "Was Fallujah attacked in 2020?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:Conflict . ?var_1 coy:hasLocation 'Fallujah' . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2020 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1356",
            "question": [
                {
                    "string": "Was Karbala attacked in 2020?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:Conflict . ?var_1 coy:hasLocation 'Karbala' . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2020 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1357",
            "question": [
                {
                    "string": "Were there military conflicts in Asia in 2021?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:ArmedClash . ?var_1 coy:hasCountryLocation / coy:hasContinentLocation 'Asia'@en . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2021 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1358",
            "question": [
                {
                    "string": "Were there military conflicts in Africa in 2021?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:ArmedClash . ?var_1 coy:hasCountryLocation / coy:hasContinentLocation 'Africa'@en . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2021 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1359",
            "question": [
                {
                    "string": "Were there military conflicts in North America in 2021?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:ArmedClash . ?var_1 coy:hasCountryLocation / coy:hasContinentLocation 'North America'@en . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2021 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1360",
            "question": [
                {
                    "string": "Were there military conflicts in South America in 2021?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:ArmedClash . ?var_1 coy:hasCountryLocation / coy:hasContinentLocation 'South America'@en . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2021 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1361",
            "question": [
                {
                    "string": "Were there military conflicts in Oceania in 2021?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:ArmedClash . ?var_1 coy:hasCountryLocation / coy:hasContinentLocation 'Oceania'@en . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2021 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1362",
            "question": [
                {
                    "string": "Were there military conflicts in Antarctica in 2021?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:ArmedClash . ?var_1 coy:hasCountryLocation / coy:hasContinentLocation 'Antarctica'@en . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2021 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1364",
            "question": [
                {
                    "string": "Were there military conflicts in Asia in 2020?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:ArmedClash . ?var_1 coy:hasCountryLocation / coy:hasContinentLocation 'Asia'@en . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2021 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1365",
            "question": [
                {
                    "string": "Were there military conflicts in Europe in 2020?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:ArmedClash . ?var_1 coy:hasCountryLocation / coy:hasContinentLocation 'Europe'@en . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2021 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1366",
            "question": [
                {
                    "string": "Were there military conflicts in North America in 2020?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:ArmedClash . ?var_1 coy:hasCountryLocation / coy:hasContinentLocation 'North America'@en . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2021 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1367",
            "question": [
                {
                    "string": "Were there military conflicts in South America in 2020?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:ArmedClash . ?var_1 coy:hasCountryLocation / coy:hasContinentLocation 'South America'@en . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2021 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1369",
            "question": [
                {
                    "string": "Were there military conflicts in Antarctica in 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:ArmedClash . ?var_1 coy:hasCountryLocation / coy:hasContinentLocation 'Antarctica'@en . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2021 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1370",
            "question": [
                {
                    "string": "Were there military conflicts in Africa in 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:ArmedClash . ?var_1 coy:hasCountryLocation / coy:hasContinentLocation 'Africa'@en . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2021 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1371",
            "question": [
                {
                    "string": "Were there military conflicts in Asia in 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:ArmedClash . ?var_1 coy:hasCountryLocation / coy:hasContinentLocation 'Asia'@en . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2021 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1372",
            "question": [
                {
                    "string": "Were there military conflicts in Europe in 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:ArmedClash . ?var_1 coy:hasCountryLocation / coy:hasContinentLocation 'Europe'@en . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2021 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1373",
            "question": [
                {
                    "string": "Were there military conflicts in North America in 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:ArmedClash . ?var_1 coy:hasCountryLocation / coy:hasContinentLocation 'North America'@en . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2021 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1374",
            "question": [
                {
                    "string": "Were there military conflicts in South America in 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:ArmedClash . ?var_1 coy:hasCountryLocation / coy:hasContinentLocation 'South America'@en . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2021 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1375",
            "question": [
                {
                    "string": "Were there military conflicts in Oceania in 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:ArmedClash . ?var_1 coy:hasCountryLocation / coy:hasContinentLocation 'Oceania'@en . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) = 2021 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1377",
            "question": [
                {
                    "string": "What are the indices of the 3 southernmost harbors in Asia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Port . ?var_2 wpi:hasIndexNumber ?var_1 . ?var_2 coy:hasLatitude ?var_3 . ?var_2 coy:hasLocation / coy:hasContinentLocation 'Asia'@en . } order by asc ( ?var_3 ) limit 3"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1378",
            "question": [
                {
                    "string": "What are the indices of the 3 westernmost harbors in Africa?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Port . ?var_2 wpi:hasIndexNumber ?var_1 . ?var_2 coy:hasLongitude ?var_3 . ?var_2 coy:hasLocation / coy:hasContinentLocation 'Africa'@en . } order by asc ( ?var_3 ) limit 3"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1379",
            "question": [
                {
                    "string": "What are the indices of the 3 easternmost harbors in North America?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Port . ?var_2 wpi:hasIndexNumber ?var_1 . ?var_2 coy:hasLongitude ?var_3 . ?var_2 coy:hasLocation / coy:hasContinentLocation 'North America'@en . } order by desc ( ?var_3 ) limit 3"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1380",
            "question": [
                {
                    "string": "What are the indices of the 3 northernmost harbors in South America?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Port . ?var_2 wpi:hasIndexNumber ?var_1 . ?var_2 coy:hasLatitude ?var_3 . ?var_2 coy:hasLocation / coy:hasContinentLocation 'South America'@en . } order by desc ( ?var_3 ) limit 3"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1381",
            "question": [
                {
                    "string": "What are the indices of the 3 southernmost harbors in Oceania?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Port . ?var_2 wpi:hasIndexNumber ?var_1 . ?var_2 coy:hasLatitude ?var_3 . ?var_2 coy:hasLocation / coy:hasContinentLocation 'Oceania'@en . } order by asc ( ?var_3 ) limit 3"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1382",
            "question": [
                {
                    "string": "What are the indices of the 3 westernmost harbors in Antarctica?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Port . ?var_2 wpi:hasIndexNumber ?var_1 . ?var_2 coy:hasLongitude ?var_3 . ?var_2 coy:hasLocation / coy:hasContinentLocation 'Antarctica'@en . } order by asc ( ?var_3 ) limit 3"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1383",
            "question": [
                {
                    "string": "What are the indices of the 3 easternmost harbors in Europe?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Port . ?var_2 wpi:hasIndexNumber ?var_1 . ?var_2 coy:hasLongitude ?var_3 . ?var_2 coy:hasLocation / coy:hasContinentLocation 'Europe'@en . } order by desc ( ?var_3 ) limit 3"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1384",
            "question": [
                {
                    "string": "What are the indices of the 3 northernmost harbors in Asia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Port . ?var_2 wpi:hasIndexNumber ?var_1 . ?var_2 coy:hasLatitude ?var_3 . ?var_2 coy:hasLocation / coy:hasContinentLocation 'Asia'@en . } order by desc ( ?var_3 ) limit 3"
            },
            "answers": [
                ""
            ]
        }
    ]
}