{
    "dataset": {
        "id": "coypu-kg-questions-train"
    },
    "questions": [
        {
            "id": "1385",
            "question": [
                {
                    "string": "What are the indices of the 3 southernmost harbors in Africa?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Port . ?var_2 wpi:hasIndexNumber ?var_1 . ?var_2 coy:hasLatitude ?var_3 . ?var_2 coy:hasLocation / coy:hasContinentLocation 'Africa'@en . } order by asc ( ?var_3 ) limit 3"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1386",
            "question": [
                {
                    "string": "What are the indices of the 3 westernmost harbors in North America?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Port . ?var_2 wpi:hasIndexNumber ?var_1 . ?var_2 coy:hasLongitude ?var_3 . ?var_2 coy:hasLocation / coy:hasContinentLocation 'North America'@en . } order by asc ( ?var_3 ) limit 3"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1387",
            "question": [
                {
                    "string": "What are the indices of the 3 easternmost harbors in South America?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Port . ?var_2 wpi:hasIndexNumber ?var_1 . ?var_2 coy:hasLongitude ?var_3 . ?var_2 coy:hasLocation / coy:hasContinentLocation 'South America'@en . } order by desc ( ?var_3 ) limit 3"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1388",
            "question": [
                {
                    "string": "What are the indices of the 3 northernmost harbors in Oceania?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Port . ?var_2 wpi:hasIndexNumber ?var_1 . ?var_2 coy:hasLatitude ?var_3 . ?var_2 coy:hasLocation / coy:hasContinentLocation 'Oceania'@en . } order by desc ( ?var_3 ) limit 3"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1389",
            "question": [
                {
                    "string": "What are the indices of the 3 southernmost harbors in Antarctica?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Port . ?var_2 wpi:hasIndexNumber ?var_1 . ?var_2 coy:hasLatitude ?var_3 . ?var_2 coy:hasLocation / coy:hasContinentLocation 'Antarctica'@en . } order by asc ( ?var_3 ) limit 3"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1390",
            "question": [
                {
                    "string": "What are the indices of the 3 westernmost harbors in Europe?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Port . ?var_2 wpi:hasIndexNumber ?var_1 . ?var_2 coy:hasLongitude ?var_3 . ?var_2 coy:hasLocation / coy:hasContinentLocation 'Europe'@en . } order by asc ( ?var_3 ) limit 3"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1391",
            "question": [
                {
                    "string": "What are the indices of the 3 easternmost harbors in Asia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Port . ?var_2 wpi:hasIndexNumber ?var_1 . ?var_2 coy:hasLongitude ?var_3 . ?var_2 coy:hasLocation / coy:hasContinentLocation 'Asia'@en . } order by desc ( ?var_3 ) limit 3"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1392",
            "question": [
                {
                    "string": "What are the indices of the 3 northernmost harbors in Africa?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Port . ?var_2 wpi:hasIndexNumber ?var_1 . ?var_2 coy:hasLatitude ?var_3 . ?var_2 coy:hasLocation / coy:hasContinentLocation 'Africa'@en . } order by desc ( ?var_3 ) limit 3"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1397",
            "question": [
                {
                    "string": "Is there a French company with more than 500,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label 'France'@en . ?var_1 coy:hasNumberOfEmployees ?var_2 . filter ( xsd:integer ( ?var_2 ) >= 500000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1398",
            "question": [
                {
                    "string": "Is there a German company with more than 50,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label 'Germany'@en . ?var_1 coy:hasNumberOfEmployees ?var_2 . filter ( xsd:integer ( ?var_2 ) >= 50000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1399",
            "question": [
                {
                    "string": "Is there a Chinese company with more than 200,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label 'China'@en . ?var_1 coy:hasNumberOfEmployees ?var_2 . filter ( xsd:integer ( ?var_2 ) >= 200000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1400",
            "question": [
                {
                    "string": "Is there a Japanese company with more than 150,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label 'Japan'@en . ?var_1 coy:hasNumberOfEmployees ?var_2 . filter ( xsd:integer ( ?var_2 ) >= 150000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1401",
            "question": [
                {
                    "string": "Is there a Canadian company with more than 80,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label 'Canada'@en . ?var_1 coy:hasNumberOfEmployees ?var_2 . filter ( xsd:integer ( ?var_2 ) >= 80000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1402",
            "question": [
                {
                    "string": "Is there a Brazilian company with more than 120,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label 'Brazil'@en . ?var_1 coy:hasNumberOfEmployees ?var_2 . filter ( xsd:integer ( ?var_2 ) >= 120000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1403",
            "question": [
                {
                    "string": "Is there a Spanish company with more than 70,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label 'Spain'@en . ?var_1 coy:hasNumberOfEmployees ?var_2 . filter ( xsd:integer ( ?var_2 ) >= 70000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1404",
            "question": [
                {
                    "string": "Is there an Indian company with more than 250,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label 'India'@en . ?var_1 coy:hasNumberOfEmployees ?var_2 . filter ( xsd:integer ( ?var_2 ) >= 250000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1405",
            "question": [
                {
                    "string": "Is there an Italian company with more than 60,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label 'Italy'@en . ?var_1 coy:hasNumberOfEmployees ?var_2 . filter ( xsd:integer ( ?var_2 ) >= 60000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1406",
            "question": [
                {
                    "string": "Is there a Russian company with more than 180,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label 'Russia'@en . ?var_1 coy:hasNumberOfEmployees ?var_2 . filter ( xsd:integer ( ?var_2 ) >= 180000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1407",
            "question": [
                {
                    "string": "Is there a South Korean company with more than 90,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label 'South Korea'@en . ?var_1 coy:hasNumberOfEmployees ?var_2 . filter ( xsd:integer ( ?var_2 ) >= 90000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1408",
            "question": [
                {
                    "string": "Is there a Mexican company with more than 40,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label 'Mexico'@en . ?var_1 coy:hasNumberOfEmployees ?var_2 . filter ( xsd:integer ( ?var_2 ) >= 40000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1409",
            "question": [
                {
                    "string": "Is there a Swiss company with more than 30,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label 'Switzerland'@en . ?var_1 coy:hasNumberOfEmployees ?var_2 . filter ( xsd:integer ( ?var_2 ) >= 30000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1410",
            "question": [
                {
                    "string": "Is there an Australian company with more than 110,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label 'Australia'@en . ?var_1 coy:hasNumberOfEmployees ?var_2 . filter ( xsd:integer ( ?var_2 ) >= 110000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1411",
            "question": [
                {
                    "string": "Is there a Dutch company with more than 20,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label 'Netherlands'@en . ?var_1 coy:hasNumberOfEmployees ?var_2 . filter ( xsd:integer ( ?var_2 ) >= 20000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1412",
            "question": [
                {
                    "string": "Is there a Swedish company with more than 130,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label 'Sweden'@en . ?var_1 coy:hasNumberOfEmployees ?var_2 . filter ( xsd:integer ( ?var_2 ) >= 130000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1413",
            "question": [
                {
                    "string": "Is there a Turkish company with more than 10,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label 'Turkey'@en . ?var_1 coy:hasNumberOfEmployees ?var_2 . filter ( xsd:integer ( ?var_2 ) >= 10000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1414",
            "question": [
                {
                    "string": "Is there a Norwegian company with more than 70,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label 'Norway'@en . ?var_1 coy:hasNumberOfEmployees ?var_2 . filter ( xsd:integer ( ?var_2 ) >= 70000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1415",
            "question": [
                {
                    "string": "Is there an Irish company with more than 25,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label 'Ireland'@en . ?var_1 coy:hasNumberOfEmployees ?var_2 . filter ( xsd:integer ( ?var_2 ) >= 25000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1416",
            "question": [
                {
                    "string": "What are the street addresses of companies in France with more than 200,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCountryLocation / rdfs:label 'France'@en . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasStreet ?var_1 . filter ( xsd:integer ( ?var_3 ) >= 200000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1417",
            "question": [
                {
                    "string": "What are the street addresses of companies in Italy with more than 50,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCountryLocation / rdfs:label 'Italy'@en . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasStreet ?var_1 . filter ( xsd:integer ( ?var_3 ) >= 50000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1418",
            "question": [
                {
                    "string": "What are the street addresses of companies in Japan with more than 150,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCountryLocation / rdfs:label 'Japan'@en . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasStreet ?var_1 . filter ( xsd:integer ( ?var_3 ) >= 150000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1419",
            "question": [
                {
                    "string": "What are the street addresses of companies in China with more than 300,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCountryLocation / rdfs:label 'China'@en . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasStreet ?var_1 . filter ( xsd:integer ( ?var_3 ) >= 300000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1420",
            "question": [
                {
                    "string": "What are the street addresses of companies in Canada with more than 80,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCountryLocation / rdfs:label 'Canada'@en . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasStreet ?var_1 . filter ( xsd:integer ( ?var_3 ) >= 80000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1421",
            "question": [
                {
                    "string": "What are the street addresses of companies in Brazil with more than 120,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCountryLocation / rdfs:label 'Brazil'@en . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasStreet ?var_1 . filter ( xsd:integer ( ?var_3 ) >= 120000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1422",
            "question": [
                {
                    "string": "What are the street addresses of companies in Spain with more than 70,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCountryLocation / rdfs:label 'Spain'@en . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasStreet ?var_1 . filter ( xsd:integer ( ?var_3 ) >= 70000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1423",
            "question": [
                {
                    "string": "What are the street addresses of companies in India with more than 250,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCountryLocation / rdfs:label 'India'@en . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasStreet ?var_1 . filter ( xsd:integer ( ?var_3 ) >= 250000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1424",
            "question": [
                {
                    "string": "What are the street addresses of companies in Russia with more than 180,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCountryLocation / rdfs:label 'Russia'@en . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasStreet ?var_1 . filter ( xsd:integer ( ?var_3 ) >= 180000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1425",
            "question": [
                {
                    "string": "What are the street addresses of companies in South Korea with more than 90,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCountryLocation / rdfs:label 'South Korea'@en . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasStreet ?var_1 . filter ( xsd:integer ( ?var_3 ) >= 90000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1426",
            "question": [
                {
                    "string": "What are the street addresses of companies in Mexico with more than 40,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCountryLocation / rdfs:label 'Mexico'@en . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasStreet ?var_1 . filter ( xsd:integer ( ?var_3 ) >= 40000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1427",
            "question": [
                {
                    "string": "What are the street addresses of companies in Switzerland with more than 30,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCountryLocation / rdfs:label 'Switzerland'@en . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasStreet ?var_1 . filter ( xsd:integer ( ?var_3 ) >= 30000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1428",
            "question": [
                {
                    "string": "What are the street addresses of companies in Australia with more than 110,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCountryLocation / rdfs:label 'Australia'@en . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasStreet ?var_1 . filter ( xsd:integer ( ?var_3 ) >= 110000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1429",
            "question": [
                {
                    "string": "What are the street addresses of companies in Netherlands with more than 20,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCountryLocation / rdfs:label 'Netherlands'@en . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasStreet ?var_1 . filter ( xsd:integer ( ?var_3 ) >= 20000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1430",
            "question": [
                {
                    "string": "What are the street addresses of companies in Sweden with more than 130,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCountryLocation / rdfs:label 'Sweden'@en . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasStreet ?var_1 . filter ( xsd:integer ( ?var_3 ) >= 130000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1431",
            "question": [
                {
                    "string": "What are the street addresses of companies in Turkey with more than 10,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCountryLocation / rdfs:label 'Turkey'@en . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasStreet ?var_1 . filter ( xsd:integer ( ?var_3 ) >= 10000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1432",
            "question": [
                {
                    "string": "What are the street addresses of companies in Norway with more than 70,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCountryLocation / rdfs:label 'Norway'@en . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasStreet ?var_1 . filter ( xsd:integer ( ?var_3 ) >= 70000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1433",
            "question": [
                {
                    "string": "What are the street addresses of companies in Ireland with more than 25,000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCountryLocation / rdfs:label 'Ireland'@en . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasStreet ?var_1 . filter ( xsd:integer ( ?var_3 ) >= 25000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1434",
            "question": [
                {
                    "string": "Which events involved chemical weapons since 2018?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) >= 2018 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1435",
            "question": [
                {
                    "string": "What incidents included chemical weapons since 2020?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) >= 2020 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1436",
            "question": [
                {
                    "string": "Which occurrences had chemical weapons since 2017?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) >= 2017 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1437",
            "question": [
                {
                    "string": "What situations involved chemical weapons since 2019?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) >= 2019 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1438",
            "question": [
                {
                    "string": "Which incidents incorporated chemical weapons since 2016?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) >= 2016 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1439",
            "question": [
                {
                    "string": "What cases witnessed chemical weapons since 2021?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) >= 2021 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1440",
            "question": [
                {
                    "string": "Which occurrences saw chemical weapons since 2018?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) >= 2018 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1441",
            "question": [
                {
                    "string": "What events encountered chemical weapons since 2017?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) >= 2017 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1442",
            "question": [
                {
                    "string": "Which situations endured chemical weapons since 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) >= 2022 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1443",
            "question": [
                {
                    "string": "What incidents faced chemical weapons since 2020?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasTimestamp ?var_2 . filter ( year ( ?var_2 ) >= 2020 ) }"
            },
            "answers": [
                ""
            ]
        }
    ]
}