{
    "dataset": {
        "id": "coypu-kg-questions-train"
    },
    "questions": [
        {
            "id": "1753",
            "question": [
                {
                    "string": "What was the most recent Disaster that struck in India?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation / rdfs:label \"India\"@en . } order by desc ( ?var_2 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1754",
            "question": [
                {
                    "string": "What was the most recent Disaster that struck in China?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation / rdfs:label \"China\"@en . } order by desc ( ?var_2 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1755",
            "question": [
                {
                    "string": "What was the most recent Disaster that struck in Russia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation / rdfs:label \"Russia\"@en . } order by desc ( ?var_2 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1756",
            "question": [
                {
                    "string": "What was the most recent Disaster that struck in South Africa?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation / rdfs:label \"South Africa\"@en . } order by desc ( ?var_2 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1757",
            "question": [
                {
                    "string": "What was the most recent Disaster that struck in Mexico?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation / rdfs:label \"Mexico\"@en . } order by desc ( ?var_2 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1758",
            "question": [
                {
                    "string": "What was the most recent Disaster that struck in Argentina?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation / rdfs:label \"Argentina\"@en . } order by desc ( ?var_2 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1759",
            "question": [
                {
                    "string": "What was the most recent Disaster that struck in Indonesia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation / rdfs:label \"Indonesia\"@en . } order by desc ( ?var_2 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1760",
            "question": [
                {
                    "string": "What was the most recent Disaster that struck in Spain?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation / rdfs:label \"Spain\"@en . } order by desc ( ?var_2 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1761",
            "question": [
                {
                    "string": "What was the most recent Disaster that struck in United Kingdom?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation / rdfs:label \"United Kingdom\"@en . } order by desc ( ?var_2 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1762",
            "question": [
                {
                    "string": "What was the most recent Disaster that struck in Iran?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation / rdfs:label \"Iran\"@en . } order by desc ( ?var_2 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1763",
            "question": [
                {
                    "string": "What was the most recent Disaster that struck in Turkey?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation / rdfs:label \"Turkey\"@en . } order by desc ( ?var_2 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1764",
            "question": [
                {
                    "string": "What was the most recent Disaster that struck in Nigeria?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation / rdfs:label \"Nigeria\"@en . } order by desc ( ?var_2 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "2009",
            "question": [
                {
                    "string": "What is the latitude of the port with the ID 'AUWMB'?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT ?latitude WHERE { ?subject coy:hasInfrastructureType \"port\" . ?subject coy:hasId \"AUWMB\" . ?subject coy:hasLatitude ?latitude .  }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "2010",
            "question": [
                {
                    "string": "What is the latitude of the port identified as 'AUWMB'?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT ?latitude WHERE { ?subject coy:hasInfrastructureType \"port\" . ?subject coy:hasId \"AUWMB\" . ?subject coy:hasLatitude ?latitude .  }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "2035",
            "question": [
                {
                    "string": "Is there any port with 'Nishtun' as the label?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ASK WHERE { ?port rdfs:label 'Nishtun' . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "2036",
            "question": [
                {
                    "string": "Is there a port called Nishtun?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ASK WHERE { ?port rdfs:label 'Nishtun' . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "2037",
            "question": [
                {
                    "string": "How many ports are on a coast?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT (COUNT(?port) AS ?count) WHERE { ?port a wpi:CoastalNaturalPort . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "2038",
            "question": [
                {
                    "string": "How many ports are classified as Coastal Natural Ports?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT (COUNT(?port) AS ?count) WHERE { ?port a wpi:CoastalNaturalPort . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "2039",
            "question": [
                {
                    "string": "Does Russia have ports?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ASK { ?subject coy:hasLocation ?country . ?subject coy:hasInfrastructureType \"port\" . ?country rdf:type coy:Country . ?country rdfs:label \"Russia\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "2040",
            "question": [
                {
                    "string": "Is there any port in Russia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ASK { ?subject coy:hasLocation ?country . ?subject coy:hasInfrastructureType \"port\" . ?country rdf:type coy:Country . ?country rdfs:label \"Russia\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "2041",
            "question": [
                {
                    "string": "How many ports provide supplies of diesel oil?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT (COUNT(?port) AS ?count) WHERE { ?port wpi:hasSuppliesDieselOil true . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "2042",
            "question": [
                {
                    "string": "How many ports provide diesel?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT (COUNT(?port) AS ?count) WHERE { ?port wpi:hasSuppliesDieselOil true . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "2043",
            "question": [
                {
                    "string": "Which port has the index number '1955'?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT ?port WHERE { ?port wpi:hasIndexNumber '1955'^^xsd:long . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "2044",
            "question": [
                {
                    "string": "What is the name of the port with index 1955?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT ?port WHERE { ?port wpi:hasIndexNumber '1955'^^xsd:long . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "2045",
            "question": [
                {
                    "string": "Is there any airport with a total seat count of over 500 million per year?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ASK WHERE { ?airport coy:hasTotalSeatsPerYear ?seats FILTER ( ?seats > 500000000 ) . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "2046",
            "question": [
                {
                    "string": "Is there any port with the label 'Warrnambool'?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ASK WHERE { ?port rdfs:label 'Warrnambool' . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "2047",
            "question": [
                {
                    "string": "Is there a port called 'Warrnambool'?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ASK WHERE { ?port rdfs:label 'Warrnambool' . }"
            },
            "answers": [
                ""
            ]
        }
    ]
}