{
    "dataset": {
        "id": "coypu-kg-questions-train"
    },
    "questions": [
        {
            "id": "1513",
            "question": [
                {
                    "string": "Does London have a sea port?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 coy:hasLocation ?var_2 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_1 rdfs:label \"London\" . ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"United Kingdom\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1514",
            "question": [
                {
                    "string": "Is Paris equipped with a sea port?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 coy:hasLocation ?var_2 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_1 rdfs:label \"Paris\" . ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"France\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1515",
            "question": [
                {
                    "string": "Does New York have a harbor?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 coy:hasLocation ?var_2 . ?var_1 coy:hasInfrastructureType \"harbor\" . ?var_1 rdfs:label \"New York\" . ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"United States\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1516",
            "question": [
                {
                    "string": "Is Sydney home to a sea port?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 coy:hasLocation ?var_2 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_1 rdfs:label \"Sydney\" . ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Australia\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1517",
            "question": [
                {
                    "string": "Does Shanghai have a maritime port?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 coy:hasLocation ?var_2 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_1 rdfs:label \"Shanghai\" . ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"China\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1518",
            "question": [
                {
                    "string": "Is Mumbai equipped with a sea port?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 coy:hasLocation ?var_2 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_1 rdfs:label \"Mumbai\" . ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"India\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1519",
            "question": [
                {
                    "string": "Does Vancouver have a harbor?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 coy:hasLocation ?var_2 . ?var_1 coy:hasInfrastructureType \"harbor\" . ?var_1 rdfs:label \"Vancouver\" . ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Canada\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1520",
            "question": [
                {
                    "string": "Is Rotterdam home to a sea port?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 coy:hasLocation ?var_2 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_1 rdfs:label \"Rotterdam\" . ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Netherlands\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1521",
            "question": [
                {
                    "string": "Does Buenos Aires have a maritime port?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 coy:hasLocation ?var_2 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_1 rdfs:label \"Buenos Aires\" . ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Argentina\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1522",
            "question": [
                {
                    "string": "Is Dubai equipped with a sea port?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 coy:hasLocation ?var_2 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_1 rdfs:label \"Dubai\" . ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"United Arab Emirates\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1523",
            "question": [
                {
                    "string": "Does Hong Kong have a harbor?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 coy:hasLocation ?var_2 . ?var_1 coy:hasInfrastructureType \"harbor\" . ?var_1 rdfs:label \"Hong Kong\" . ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"China\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1524",
            "question": [
                {
                    "string": "Is Los Angeles home to a sea port?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 coy:hasLocation ?var_2 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_1 rdfs:label \"Los Angeles\" . ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"United States\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1525",
            "question": [
                {
                    "string": "Does Hamburg have a maritime port?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 coy:hasLocation ?var_2 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_1 rdfs:label \"Hamburg\" . ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Germany\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1526",
            "question": [
                {
                    "string": "Is Singapore equipped with a sea port?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 coy:hasLocation ?var_2 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_1 rdfs:label \"Singapore\" . ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Singapore\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1527",
            "question": [
                {
                    "string": "Does Sydney have a harbor?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 coy:hasLocation ?var_2 . ?var_1 coy:hasInfrastructureType \"harbor\" . ?var_1 rdfs:label \"Sydney\" . ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Australia\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1528",
            "question": [
                {
                    "string": "Is Barcelona home to a sea port?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 coy:hasLocation ?var_2 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_1 rdfs:label \"Barcelona\" . ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Spain\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1529",
            "question": [
                {
                    "string": "Does Istanbul have a maritime port?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 coy:hasLocation ?var_2 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_1 rdfs:label \"Istanbul\" . ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Turkey\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1530",
            "question": [
                {
                    "string": "Is Miami equipped with a sea port?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 coy:hasLocation ?var_2 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_1 rdfs:label \"Miami\" . ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"United States\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1531",
            "question": [
                {
                    "string": "Does Oslo have a harbor?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 coy:hasLocation ?var_2 . ?var_1 coy:hasInfrastructureType \"harbor\" . ?var_1 rdfs:label \"Oslo\" . ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Norway\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1532",
            "question": [
                {
                    "string": "Is Mumbai home to a sea port?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 coy:hasLocation ?var_2 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_1 rdfs:label \"Mumbai\" . ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"India\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1533",
            "question": [
                {
                    "string": "How many sea ports are there in Japan?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select (count(distinct ?var_1) as ?var_2) where { ?var_1 coy:hasLocation ?var_3 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_3 rdf:type coy:Country . ?var_3 skos:altLabel \"Japan\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1534",
            "question": [
                {
                    "string": "How many harbors are there in Germany?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select (count(distinct ?var_1) as ?var_2) where { ?var_1 coy:hasLocation ?var_3 . ?var_1 coy:hasInfrastructureType \"harbor\" . ?var_3 rdf:type coy:Country . ?var_3 skos:altLabel \"Germany\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1535",
            "question": [
                {
                    "string": "How many sea ports are there in Australia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select (count(distinct ?var_1) as ?var_2) where { ?var_1 coy:hasLocation ?var_3 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_3 rdf:type coy:Country . ?var_3 skos:altLabel \"Australia\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1536",
            "question": [
                {
                    "string": "How many ports are there in India?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select (count(distinct ?var_1) as ?var_2) where { ?var_1 coy:hasLocation ?var_3 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_3 rdf:type coy:Country . ?var_3 skos:altLabel \"India\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1537",
            "question": [
                {
                    "string": "How many sea ports are there in France?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select (count(distinct ?var_1) as ?var_2) where { ?var_1 coy:hasLocation ?var_3 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_3 rdf:type coy:Country . ?var_3 skos:altLabel \"France\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1538",
            "question": [
                {
                    "string": "How many ports are there in the United States?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select (count(distinct ?var_1) as ?var_2) where { ?var_1 coy:hasLocation ?var_3 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_3 rdf:type coy:Country . ?var_3 skos:altLabel \"United States\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1539",
            "question": [
                {
                    "string": "How many sea ports are there in Canada?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select (count(distinct ?var_1) as ?var_2) where { ?var_1 coy:hasLocation ?var_3 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_3 rdf:type coy:Country . ?var_3 skos:altLabel \"Canada\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1540",
            "question": [
                {
                    "string": "How many harbors are there in Spain?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select (count(distinct ?var_1) as ?var_2) where { ?var_1 coy:hasLocation ?var_3 . ?var_1 coy:hasInfrastructureType \"harbor\" . ?var_3 rdf:type coy:Country . ?var_3 skos:altLabel \"Spain\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1541",
            "question": [
                {
                    "string": "How many sea ports are there in Singapore?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select (count(distinct ?var_1) as ?var_2) where { ?var_1 coy:hasLocation ?var_3 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_3 rdf:type coy:Country . ?var_3 skos:altLabel \"Singapore\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1542",
            "question": [
                {
                    "string": "How many ports are there in the Netherlands?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select (count(distinct ?var_1) as ?var_2) where { ?var_1 coy:hasLocation ?var_3 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_3 rdf:type coy:Country . ?var_3 skos:altLabel \"Netherlands\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1543",
            "question": [
                {
                    "string": "How many sea ports are there in Argentina?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select (count(distinct ?var_1) as ?var_2) where { ?var_1 coy:hasLocation ?var_3 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_3 rdf:type coy:Country . ?var_3 skos:altLabel \"Argentina\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1544",
            "question": [
                {
                    "string": "How many ports are there in the United Arab Emirates?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select (count(distinct ?var_1) as ?var_2) where { ?var_1 coy:hasLocation ?var_3 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_3 rdf:type coy:Country . ?var_3 skos:altLabel \"United Arab Emirates\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1545",
            "question": [
                {
                    "string": "How many sea ports are there in Russia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select (count(distinct ?var_1) as ?var_2) where { ?var_1 coy:hasLocation ?var_3 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_3 rdf:type coy:Country . ?var_3 skos:altLabel \"Russia\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1546",
            "question": [
                {
                    "string": "How many ports are there in Brazil?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select (count(distinct ?var_1) as ?var_2) where { ?var_1 coy:hasLocation ?var_3 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_3 rdf:type coy:Country . ?var_3 skos:altLabel \"Brazil\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1547",
            "question": [
                {
                    "string": "How many sea ports are there in South Korea?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select (count(distinct ?var_1) as ?var_2) where { ?var_1 coy:hasLocation ?var_3 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_3 rdf:type coy:Country . ?var_3 skos:altLabel \"South Korea\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1548",
            "question": [
                {
                    "string": "How many ports are there in Italy?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select (count(distinct ?var_1) as ?var_2) where { ?var_1 coy:hasLocation ?var_3 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_3 rdf:type coy:Country . ?var_3 skos:altLabel \"Italy\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1549",
            "question": [
                {
                    "string": "How many sea ports are there in Thailand?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select (count(distinct ?var_1) as ?var_2) where { ?var_1 coy:hasLocation ?var_3 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_3 rdf:type coy:Country . ?var_3 skos:altLabel \"Thailand\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1550",
            "question": [
                {
                    "string": "How many ports are there in Indonesia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select (count(distinct ?var_1) as ?var_2) where { ?var_1 coy:hasLocation ?var_3 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_3 rdf:type coy:Country . ?var_3 skos:altLabel \"Indonesia\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1551",
            "question": [
                {
                    "string": "How many sea ports are there in the United Kingdom?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select (count(distinct ?var_1) as ?var_2) where { ?var_1 coy:hasLocation ?var_3 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_3 rdf:type coy:Country . ?var_3 skos:altLabel \"United Kingdom\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1552",
            "question": [
                {
                    "string": "How many ports are there in Greece?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select (count(distinct ?var_1) as ?var_2) where { ?var_1 coy:hasLocation ?var_3 . ?var_1 coy:hasInfrastructureType \"port\" . ?var_3 rdf:type coy:Country . ?var_3 skos:altLabel \"Greece\"@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1553",
            "question": [
                {
                    "string": "Is there currently a natural disaster in Japan?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation ?var_2 . ?var_1 coy:hasStartDate ?var_3 . ?var_2 rdfs:label \"Japan\"@en . filter (not exists { ?var_1 coy:hasEndDate ?var_4 }) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1554",
            "question": [
                {
                    "string": "Is there currently a natural disaster in Brazil?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation ?var_2 . ?var_1 coy:hasStartDate ?var_3 . ?var_2 rdfs:label \"Brazil\"@en . filter (not exists { ?var_1 coy:hasEndDate ?var_4 }) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1555",
            "question": [
                {
                    "string": "Is there currently a natural disaster in Australia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation ?var_2 . ?var_1 coy:hasStartDate ?var_3 . ?var_2 rdfs:label \"Australia\"@en . filter (not exists { ?var_1 coy:hasEndDate ?var_4 }) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1556",
            "question": [
                {
                    "string": "Is there currently a natural disaster in the United States?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation ?var_2 . ?var_1 coy:hasStartDate ?var_3 . ?var_2 rdfs:label \"United States\"@en . filter (not exists { ?var_1 coy:hasEndDate ?var_4 }) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1557",
            "question": [
                {
                    "string": "Is there currently a natural disaster in China?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation ?var_2 . ?var_1 coy:hasStartDate ?var_3 . ?var_2 rdfs:label \"China\"@en . filter (not exists { ?var_1 coy:hasEndDate ?var_4 }) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1558",
            "question": [
                {
                    "string": "Is there currently a natural disaster in India?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation ?var_2 . ?var_1 coy:hasStartDate ?var_3 . ?var_2 rdfs:label \"India\"@en . filter (not exists { ?var_1 coy:hasEndDate ?var_4 }) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1559",
            "question": [
                {
                    "string": "Is there currently a natural disaster in Russia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation ?var_2 . ?var_1 coy:hasStartDate ?var_3 . ?var_2 rdfs:label \"Russia\"@en . filter (not exists { ?var_1 coy:hasEndDate ?var_4 }) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1560",
            "question": [
                {
                    "string": "Is there currently a natural disaster in Germany?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation ?var_2 . ?var_1 coy:hasStartDate ?var_3 . ?var_2 rdfs:label \"Germany\"@en . filter (not exists { ?var_1 coy:hasEndDate ?var_4 }) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1561",
            "question": [
                {
                    "string": "Is there currently a natural disaster in Canada?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation ?var_2 . ?var_1 coy:hasStartDate ?var_3 . ?var_2 rdfs:label \"Canada\"@en . filter (not exists { ?var_1 coy:hasEndDate ?var_4 }) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1562",
            "question": [
                {
                    "string": "Is there currently a natural disaster in France?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation ?var_2 . ?var_1 coy:hasStartDate ?var_3 . ?var_2 rdfs:label \"France\"@en . filter (not exists { ?var_1 coy:hasEndDate ?var_4 }) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1563",
            "question": [
                {
                    "string": "When was the last earthquake in France?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Disaster . ?var_2 coy:hasEventType \"EQ\" . ?var_2 coy:hasCountryLocation ?var_3 . ?var_2 coy:hasTimestamp ?var_1 . ?var_3 rdfs:label \"France\"@en } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1564",
            "question": [
                {
                    "string": "When was the last earthquake in Germany?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Disaster . ?var_2 coy:hasEventType \"EQ\" . ?var_2 coy:hasCountryLocation ?var_3 . ?var_2 coy:hasTimestamp ?var_1 . ?var_3 rdfs:label \"Germany\"@en } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1565",
            "question": [
                {
                    "string": "When was the last earthquake in Spain?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Disaster . ?var_2 coy:hasEventType \"EQ\" . ?var_2 coy:hasCountryLocation ?var_3 . ?var_2 coy:hasTimestamp ?var_1 . ?var_3 rdfs:label \"Spain\"@en } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1566",
            "question": [
                {
                    "string": "When was the last earthquake in United States?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Disaster . ?var_2 coy:hasEventType \"EQ\" . ?var_2 coy:hasCountryLocation ?var_3 . ?var_2 coy:hasTimestamp ?var_1 . ?var_3 rdfs:label \"United States\"@en } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1567",
            "question": [
                {
                    "string": "When was the last earthquake in India?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Disaster . ?var_2 coy:hasEventType \"EQ\" . ?var_2 coy:hasCountryLocation ?var_3 . ?var_2 coy:hasTimestamp ?var_1 . ?var_3 rdfs:label \"India\"@en } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1568",
            "question": [
                {
                    "string": "When was the last earthquake in Brazil?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Disaster . ?var_2 coy:hasEventType \"EQ\" . ?var_2 coy:hasCountryLocation ?var_3 . ?var_2 coy:hasTimestamp ?var_1 . ?var_3 rdfs:label \"Brazil\"@en } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1569",
            "question": [
                {
                    "string": "When was the last earthquake in Russia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Disaster . ?var_2 coy:hasEventType \"EQ\" . ?var_2 coy:hasCountryLocation ?var_3 . ?var_2 coy:hasTimestamp ?var_1 . ?var_3 rdfs:label \"Russia\"@en } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        }
    ]
}