{
    "dataset": {
        "id": "coypu-kg-questions-train"
    },
    "questions": [
        {
            "id": "1695",
            "question": [
                {
                    "string": "What capacity does the biggest powerplant in Italy have?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasCountryLocation / rdfs:label \"Italy\"@en . ?var_2 coy:hasCapacity ?var_1 } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1696",
            "question": [
                {
                    "string": "What capacity does the biggest powerplant in South Korea have?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasCountryLocation / rdfs:label \"South Korea\"@en . ?var_2 coy:hasCapacity ?var_1 } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1697",
            "question": [
                {
                    "string": "What capacity does the biggest powerplant in Canada have?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasCountryLocation / rdfs:label \"Canada\"@en . ?var_2 coy:hasCapacity ?var_1 } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1698",
            "question": [
                {
                    "string": "What capacity does the biggest powerplant in Australia have?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasCountryLocation / rdfs:label \"Australia\"@en . ?var_2 coy:hasCapacity ?var_1 } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1699",
            "question": [
                {
                    "string": "What capacity does the biggest powerplant in Spain have?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasCountryLocation / rdfs:label \"Spain\"@en . ?var_2 coy:hasCapacity ?var_1 } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1700",
            "question": [
                {
                    "string": "What capacity does the biggest powerplant in Mexico have?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasCountryLocation / rdfs:label \"Mexico\"@en . ?var_2 coy:hasCapacity ?var_1 } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1701",
            "question": [
                {
                    "string": "What capacity does the biggest powerplant in Turkey have?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasCountryLocation / rdfs:label \"Turkey\"@en . ?var_2 coy:hasCapacity ?var_1 } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1702",
            "question": [
                {
                    "string": "What capacity does the biggest powerplant in Saudi Arabia have?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasCountryLocation / rdfs:label \"Saudi Arabia\"@en . ?var_2 coy:hasCapacity ?var_1 } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1703",
            "question": [
                {
                    "string": "What capacity does the biggest powerplant in Switzerland have?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasCountryLocation / rdfs:label \"Switzerland\"@en . ?var_2 coy:hasCapacity ?var_1 } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1704",
            "question": [
                {
                    "string": "What capacity does the biggest powerplant in Netherlands have?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasCountryLocation / rdfs:label \"Netherlands\"@en . ?var_2 coy:hasCapacity ?var_1 } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1705",
            "question": [
                {
                    "string": "What capacity does the biggest powerplant in Belgium have?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasCountryLocation / rdfs:label \"Belgium\"@en . ?var_2 coy:hasCapacity ?var_1 } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1706",
            "question": [
                {
                    "string": "What fuel types does the powerplant Grand River Dam Authority use?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasName \"Grand River Dam Authority\" . ?var_2 coy:hasFuelType ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1707",
            "question": [
                {
                    "string": "What fuel types does the powerplant Atikokan Generating Station use?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasName \"Atikokan Generating Station\" . ?var_2 coy:hasFuelType ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1708",
            "question": [
                {
                    "string": "What fuel types does the powerplant Manjil Dam use?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasName \"Manjil Dam\" . ?var_2 coy:hasFuelType ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1709",
            "question": [
                {
                    "string": "What fuel types does the powerplant Macagua Dam use?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasName \"Macagua Dam\" . ?var_2 coy:hasFuelType ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1710",
            "question": [
                {
                    "string": "What fuel types does the powerplant Upper Yeywa Dam use?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasName \"Upper Yeywa Dam\" . ?var_2 coy:hasFuelType ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1711",
            "question": [
                {
                    "string": "What fuel types does the powerplant Kajbar Dam use?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasName \"Kajbar Dam\" . ?var_2 coy:hasFuelType ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1712",
            "question": [
                {
                    "string": "What fuel types does the powerplant Tatai Dam use?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasName \"Tatai Dam\" . ?var_2 coy:hasFuelType ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1713",
            "question": [
                {
                    "string": "What fuel types does the powerplant Bumbuna Dam use?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasName \"Bumbuna Dam\" . ?var_2 coy:hasFuelType ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1714",
            "question": [
                {
                    "string": "What fuel types does the powerplant Barra Grande Dam use?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasName \"Barra Grande Dam\" . ?var_2 coy:hasFuelType ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1715",
            "question": [
                {
                    "string": "What fuel types does the powerplant Lower Subansiri Dam use?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasName \"Lower Subansiri Dam\" . ?var_2 coy:hasFuelType ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1716",
            "question": [
                {
                    "string": "What fuel types does the powerplant Baihetan Dam use?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasName \"Baihetan Dam\" . ?var_2 coy:hasFuelType ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1717",
            "question": [
                {
                    "string": "What fuel types does the powerplant Tucuru\u00ed Dam use?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasName \"Tucuru\u00ed Dam\" . ?var_2 coy:hasFuelType ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1718",
            "question": [
                {
                    "string": "What fuel types does the powerplant Srisailam Dam use?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasName \"Srisailam Dam\" . ?var_2 coy:hasFuelType ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1719",
            "question": [
                {
                    "string": "What fuel types does the powerplant Akosombo Dam use?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasName \"Akosombo Dam\" . ?var_2 coy:hasFuelType ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1720",
            "question": [
                {
                    "string": "What fuel types does the powerplant Blue Nile Dam use?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasName \"Blue Nile Dam\" . ?var_2 coy:hasFuelType ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1721",
            "question": [
                {
                    "string": "What fuel types does the powerplant Foz do Chapec\u00f3 Dam use?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasName \"Foz do Chapec\u00f3 Dam\" . ?var_2 coy:hasFuelType ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1722",
            "question": [
                {
                    "string": "What fuel types does the powerplant Ilisu Dam use?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasName \"Ilisu Dam\" . ?var_2 coy:hasFuelType ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1723",
            "question": [
                {
                    "string": "What fuel types does the powerplant Mangla Dam use?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasName \"Mangla Dam\" . ?var_2 coy:hasFuelType ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1724",
            "question": [
                {
                    "string": "What fuel types does the powerplant Wivenhoe Dam use?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasName \"Wivenhoe Dam\" . ?var_2 coy:hasFuelType ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1725",
            "question": [
                {
                    "string": "What fuel types does the powerplant Itaipu Dam use?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasName \"Itaipu Dam\" . ?var_2 coy:hasFuelType ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1726",
            "question": [
                {
                    "string": "How many power plants in Canada work with gas?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType \"Gas\" . ?var_1 coy:hasCountryLocation / rdfs:label \"Canada\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1727",
            "question": [
                {
                    "string": "How many power plants in Brazil work with gas?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType \"Gas\" . ?var_1 coy:hasCountryLocation / rdfs:label \"Brazil\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1728",
            "question": [
                {
                    "string": "How many power plants in China work with gas?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType \"Gas\" . ?var_1 coy:hasCountryLocation / rdfs:label \"China\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1729",
            "question": [
                {
                    "string": "How many power plants in Russia work with gas?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType \"Gas\" . ?var_1 coy:hasCountryLocation / rdfs:label \"Russia\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1730",
            "question": [
                {
                    "string": "How many power plants in United States work with gas?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType \"Gas\" . ?var_1 coy:hasCountryLocation / rdfs:label \"United States\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1731",
            "question": [
                {
                    "string": "How many power plants in Indonesia work with gas?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType \"Gas\" . ?var_1 coy:hasCountryLocation / rdfs:label \"Indonesia\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1732",
            "question": [
                {
                    "string": "How many power plants in Australia work with gas?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType \"Gas\" . ?var_1 coy:hasCountryLocation / rdfs:label \"Australia\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1733",
            "question": [
                {
                    "string": "How many power plants in Japan work with gas?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType \"Gas\" . ?var_1 coy:hasCountryLocation / rdfs:label \"Japan\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1734",
            "question": [
                {
                    "string": "How many power plants in Germany work with gas?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType \"Gas\" . ?var_1 coy:hasCountryLocation / rdfs:label \"Germany\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1735",
            "question": [
                {
                    "string": "How many power plants in South Korea work with gas?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType \"Gas\" . ?var_1 coy:hasCountryLocation / rdfs:label \"South Korea\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1736",
            "question": [
                {
                    "string": "How many power plants in South Africa work with gas?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType \"Gas\" . ?var_1 coy:hasCountryLocation / rdfs:label \"South Africa\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1737",
            "question": [
                {
                    "string": "How many power plants in Mexico work with gas?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType \"Gas\" . ?var_1 coy:hasCountryLocation / rdfs:label \"Mexico\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1738",
            "question": [
                {
                    "string": "How many power plants in Saudi Arabia work with gas?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType \"Gas\" . ?var_1 coy:hasCountryLocation / rdfs:label \"Saudi Arabia\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1739",
            "question": [
                {
                    "string": "How many power plants in Turkey work with gas?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType \"Gas\" . ?var_1 coy:hasCountryLocation / rdfs:label \"Turkey\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1740",
            "question": [
                {
                    "string": "How many power plants in Iran work with gas?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType \"Gas\" . ?var_1 coy:hasCountryLocation / rdfs:label \"Iran\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1741",
            "question": [
                {
                    "string": "How many power plants in United Kingdom work with gas?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType \"Gas\" . ?var_1 coy:hasCountryLocation / rdfs:label \"United Kingdom\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1742",
            "question": [
                {
                    "string": "How many power plants in Malaysia work with gas?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType \"Gas\" . ?var_1 coy:hasCountryLocation / rdfs:label \"Malaysia\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1743",
            "question": [
                {
                    "string": "How many power plants in Iraq work with gas?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType \"Gas\" . ?var_1 coy:hasCountryLocation / rdfs:label \"Iraq\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1744",
            "question": [
                {
                    "string": "How many power plants in Thailand work with gas?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType \"Gas\" . ?var_1 coy:hasCountryLocation / rdfs:label \"Thailand\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1745",
            "question": [
                {
                    "string": "How many power plants in Italy work with gas?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType \"Gas\" . ?var_1 coy:hasCountryLocation / rdfs:label \"Italy\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1746",
            "question": [
                {
                    "string": "What was the most recent Disaster that struck in France?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation / rdfs:label \"France\"@en . } order by desc ( ?var_2 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1747",
            "question": [
                {
                    "string": "What was the most recent Disaster that struck in Germany?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation / rdfs:label \"Germany\"@en . } order by desc ( ?var_2 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1748",
            "question": [
                {
                    "string": "What was the most recent Disaster that struck in Italy?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation / rdfs:label \"Italy\"@en . } order by desc ( ?var_2 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1749",
            "question": [
                {
                    "string": "What was the most recent Disaster that struck in Japan?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation / rdfs:label \"Japan\"@en . } order by desc ( ?var_2 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1750",
            "question": [
                {
                    "string": "What was the most recent Disaster that struck in Brazil?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation / rdfs:label \"Brazil\"@en . } order by desc ( ?var_2 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1751",
            "question": [
                {
                    "string": "What was the most recent Disaster that struck in Canada?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation / rdfs:label \"Canada\"@en . } order by desc ( ?var_2 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1752",
            "question": [
                {
                    "string": "What was the most recent Disaster that struck in Australia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation / rdfs:label \"Australia\"@en . } order by desc ( ?var_2 ) limit 1"
            },
            "answers": [
                ""
            ]
        }
    ]
}