{
    "dataset": {
        "id": "coypu-kg-questions-train"
    },
    "questions": [
        {
            "id": "1570",
            "question": [
                {
                    "string": "When was the last earthquake in Japan?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Disaster . ?var_2 coy:hasEventType \"EQ\" . ?var_2 coy:hasCountryLocation ?var_3 . ?var_2 coy:hasTimestamp ?var_1 . ?var_3 rdfs:label \"Japan\"@en } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1572",
            "question": [
                {
                    "string": "When was the last earthquake in Italy?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Disaster . ?var_2 coy:hasEventType \"EQ\" . ?var_2 coy:hasCountryLocation ?var_3 . ?var_2 coy:hasTimestamp ?var_1 . ?var_3 rdfs:label \"Italy\"@en } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1573",
            "question": [
                {
                    "string": "When was the last earthquake in South Korea?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Disaster . ?var_2 coy:hasEventType \"EQ\" . ?var_2 coy:hasCountryLocation ?var_3 . ?var_2 coy:hasTimestamp ?var_1 . ?var_3 rdfs:label \"South Korea\"@en } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1574",
            "question": [
                {
                    "string": "When was the last earthquake in Turkey?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Disaster . ?var_2 coy:hasEventType \"EQ\" . ?var_2 coy:hasCountryLocation ?var_3 . ?var_2 coy:hasTimestamp ?var_1 . ?var_3 rdfs:label \"Turkey\"@en } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1575",
            "question": [
                {
                    "string": "When was the last earthquake in Canada?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Disaster . ?var_2 coy:hasEventType \"EQ\" . ?var_2 coy:hasCountryLocation ?var_3 . ?var_2 coy:hasTimestamp ?var_1 . ?var_3 rdfs:label \"Canada\"@en } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1576",
            "question": [
                {
                    "string": "When was the last earthquake in Mexico?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Disaster . ?var_2 coy:hasEventType \"EQ\" . ?var_2 coy:hasCountryLocation ?var_3 . ?var_2 coy:hasTimestamp ?var_1 . ?var_3 rdfs:label \"Mexico\"@en } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1577",
            "question": [
                {
                    "string": "When was the last earthquake in Argentina?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Disaster . ?var_2 coy:hasEventType \"EQ\" . ?var_2 coy:hasCountryLocation ?var_3 . ?var_2 coy:hasTimestamp ?var_1 . ?var_3 rdfs:label \"Argentina\"@en } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1578",
            "question": [
                {
                    "string": "When was the last earthquake in United Kingdom?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Disaster . ?var_2 coy:hasEventType \"EQ\" . ?var_2 coy:hasCountryLocation ?var_3 . ?var_2 coy:hasTimestamp ?var_1 . ?var_3 rdfs:label \"United Kingdom\"@en } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1579",
            "question": [
                {
                    "string": "When was the last earthquake in Australia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Disaster . ?var_2 coy:hasEventType \"EQ\" . ?var_2 coy:hasCountryLocation ?var_3 . ?var_2 coy:hasTimestamp ?var_1 . ?var_3 rdfs:label \"Australia\"@en } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1580",
            "question": [
                {
                    "string": "When was the last earthquake in Saudi Arabia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Disaster . ?var_2 coy:hasEventType \"EQ\" . ?var_2 coy:hasCountryLocation ?var_3 . ?var_2 coy:hasTimestamp ?var_1 . ?var_3 rdfs:label \"Saudi Arabia\"@en } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1581",
            "question": [
                {
                    "string": "When was the last earthquake in Pakistan?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Disaster . ?var_2 coy:hasEventType \"EQ\" . ?var_2 coy:hasCountryLocation ?var_3 . ?var_2 coy:hasTimestamp ?var_1 . ?var_3 rdfs:label \"Pakistan\"@en } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1582",
            "question": [
                {
                    "string": "What is the international acronym of France?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"France\"@en . ?var_2 coy:hasIsoCode ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1583",
            "question": [
                {
                    "string": "What is the international acronym of Germany?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Germany\"@en . ?var_2 coy:hasIsoCode ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1584",
            "question": [
                {
                    "string": "What is the international acronym of Spain?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Spain\"@en . ?var_2 coy:hasIsoCode ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1585",
            "question": [
                {
                    "string": "What is the international acronym of United States?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"United States\"@en . ?var_2 coy:hasIsoCode ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1586",
            "question": [
                {
                    "string": "What is the international acronym of India?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"India\"@en . ?var_2 coy:hasIsoCode ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1587",
            "question": [
                {
                    "string": "What is the international acronym of Brazil?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Brazil\"@en . ?var_2 coy:hasIsoCode ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1588",
            "question": [
                {
                    "string": "What is the international acronym of Russia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Russia\"@en . ?var_2 coy:hasIsoCode ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1589",
            "question": [
                {
                    "string": "What is the international acronym of Japan?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Japan\"@en . ?var_2 coy:hasIsoCode ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1590",
            "question": [
                {
                    "string": "What is the international acronym of Indonesia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Indonesia\"@en . ?var_2 coy:hasIsoCode ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1591",
            "question": [
                {
                    "string": "What is the international acronym of Italy?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Italy\"@en . ?var_2 coy:hasIsoCode ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1592",
            "question": [
                {
                    "string": "What is the international acronym of South Korea?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"South Korea\"@en . ?var_2 coy:hasIsoCode ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1593",
            "question": [
                {
                    "string": "What is the international acronym of Turkey?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Turkey\"@en . ?var_2 coy:hasIsoCode ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1594",
            "question": [
                {
                    "string": "What is the international acronym of Canada?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Canada\"@en . ?var_2 coy:hasIsoCode ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1595",
            "question": [
                {
                    "string": "What is the international acronym of Mexico?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Mexico\"@en . ?var_2 coy:hasIsoCode ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1596",
            "question": [
                {
                    "string": "What is the international acronym of Argentina?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Argentina\"@en . ?var_2 coy:hasIsoCode ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1597",
            "question": [
                {
                    "string": "What is the international acronym of United Kingdom?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"United Kingdom\"@en . ?var_2 coy:hasIsoCode ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1598",
            "question": [
                {
                    "string": "What is the international acronym of Australia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Australia\"@en . ?var_2 coy:hasIsoCode ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1600",
            "question": [
                {
                    "string": "What is the international acronym of Pakistan?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Pakistan\"@en . ?var_2 coy:hasIsoCode ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1601",
            "question": [
                {
                    "string": "What is the risk level of France?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"France\"@en . ?var_2 coy:hasRiskLevel ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1602",
            "question": [
                {
                    "string": "What is the risk level of Spain?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Spain\"@en . ?var_2 coy:hasRiskLevel ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1603",
            "question": [
                {
                    "string": "What is the risk level of United States?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"United States\"@en . ?var_2 coy:hasRiskLevel ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1604",
            "question": [
                {
                    "string": "What is the risk level of India?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"India\"@en . ?var_2 coy:hasRiskLevel ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1605",
            "question": [
                {
                    "string": "What is the risk level of Brazil?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Brazil\"@en . ?var_2 coy:hasRiskLevel ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1606",
            "question": [
                {
                    "string": "What is the risk level of Russia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Russia\"@en . ?var_2 coy:hasRiskLevel ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1607",
            "question": [
                {
                    "string": "What is the risk level of Japan?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Japan\"@en . ?var_2 coy:hasRiskLevel ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1608",
            "question": [
                {
                    "string": "What is the risk level of Indonesia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Indonesia\"@en . ?var_2 coy:hasRiskLevel ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1609",
            "question": [
                {
                    "string": "What is the risk level of Italy?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Italy\"@en . ?var_2 coy:hasRiskLevel ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1610",
            "question": [
                {
                    "string": "What is the risk level of South Korea?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"South Korea\"@en . ?var_2 coy:hasRiskLevel ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1611",
            "question": [
                {
                    "string": "What is the risk level of Turkey?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Turkey\"@en . ?var_2 coy:hasRiskLevel ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1612",
            "question": [
                {
                    "string": "What is the risk level of Canada?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Canada\"@en . ?var_2 coy:hasRiskLevel ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1613",
            "question": [
                {
                    "string": "What is the risk level of Mexico?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Mexico\"@en . ?var_2 coy:hasRiskLevel ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1614",
            "question": [
                {
                    "string": "What is the risk level of Argentina?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Argentina\"@en . ?var_2 coy:hasRiskLevel ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1615",
            "question": [
                {
                    "string": "What is the risk level of United Kingdom?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"United Kingdom\"@en . ?var_2 coy:hasRiskLevel ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1616",
            "question": [
                {
                    "string": "What is the risk level of Australia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Australia\"@en . ?var_2 coy:hasRiskLevel ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1617",
            "question": [
                {
                    "string": "What is the risk level of Saudi Arabia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Saudi Arabia\"@en . ?var_2 coy:hasRiskLevel ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1618",
            "question": [
                {
                    "string": "What is the risk level of Pakistan?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Country . ?var_2 rdfs:label \"Pakistan\"@en . ?var_2 coy:hasRiskLevel ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1619",
            "question": [
                {
                    "string": "How many disasters happened in 2021 with level 0?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasAlertScore ?var_3 . ?var_1 coy:hasTimestamp ?var_4 . filter ( ( year ( xsd:dateTime ( ?var_4 ) ) = 2021 ) && ( ?var_3 = \"0\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1620",
            "question": [
                {
                    "string": "How many disasters happened in 2021 with level 1?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasAlertScore ?var_3 . ?var_1 coy:hasTimestamp ?var_4 . filter ( ( year ( xsd:dateTime ( ?var_4 ) ) = 2021 ) && ( ?var_3 = \"1\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1621",
            "question": [
                {
                    "string": "How many disasters happened in 2021 with level 2?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasAlertScore ?var_3 . ?var_1 coy:hasTimestamp ?var_4 . filter ( ( year ( xsd:dateTime ( ?var_4 ) ) = 2021 ) && ( ?var_3 = \"2\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1622",
            "question": [
                {
                    "string": "How many disasters happened in 2021 with green?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasAlertColor ?var_3 . ?var_1 coy:hasTimestamp ?var_4 . filter ( ( year ( xsd:dateTime ( ?var_4 ) ) = 2021 ) && ( ?var_3 = \"0\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1623",
            "question": [
                {
                    "string": "How many disasters happened in 2021 with orange?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasAlertColor ?var_3 . ?var_1 coy:hasTimestamp ?var_4 . filter ( ( year ( xsd:dateTime ( ?var_4 ) ) = 2021 ) && ( ?var_3 = \"1\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1624",
            "question": [
                {
                    "string": "How many disasters happened in 2021 with red?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasAlertColor ?var_3 . ?var_1 coy:hasTimestamp ?var_4 . filter ( ( year ( xsd:dateTime ( ?var_4 ) ) = 2021 ) && ( ?var_3 = \"2\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1625",
            "question": [
                {
                    "string": "Is there an airport in Kabul?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Airport . ?var_1 coy:hasCountry \"Afghanistan\" . ?var_1 coy:hasName ?var_2 . filter ( regex ( ?var_2 , \"Kabul\" , \"i\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1626",
            "question": [
                {
                    "string": "Is there an airport in Herat?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Airport . ?var_1 coy:hasCountry \"Afghanistan\" . ?var_1 coy:hasName ?var_2 . filter ( regex ( ?var_2 , \"Herat\" , \"i\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1627",
            "question": [
                {
                    "string": "Is there an airport in Mazar-i-Sharif?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Airport . ?var_1 coy:hasCountry \"Afghanistan\" . ?var_1 coy:hasName ?var_2 . filter ( regex ( ?var_2 , \"Mazar-i-Sharif\" , \"i\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1628",
            "question": [
                {
                    "string": "Is there an airport in Jalalabad?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Airport . ?var_1 coy:hasCountry \"Afghanistan\" . ?var_1 coy:hasName ?var_2 . filter ( regex ( ?var_2 , \"Jalalabad\" , \"i\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1629",
            "question": [
                {
                    "string": "Is there an airport in Kunduz?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Airport . ?var_1 coy:hasCountry \"Afghanistan\" . ?var_1 coy:hasName ?var_2 . filter ( regex ( ?var_2 , \"Kunduz\" , \"i\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1630",
            "question": [
                {
                    "string": "Is there an airport in Lashkar Gah?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Airport . ?var_1 coy:hasCountry \"Afghanistan\" . ?var_1 coy:hasName ?var_2 . filter ( regex ( ?var_2 , \"Lashkar Gah\" , \"i\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1631",
            "question": [
                {
                    "string": "Is there an airport in Taloqan?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Airport . ?var_1 coy:hasCountry \"Afghanistan\" . ?var_1 coy:hasName ?var_2 . filter ( regex ( ?var_2 , \"Taloqan\" , \"i\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1632",
            "question": [
                {
                    "string": "Is there an airport in Sheberghan?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Airport . ?var_1 coy:hasCountry \"Afghanistan\" . ?var_1 coy:hasName ?var_2 . filter ( regex ( ?var_2 , \"Sheberghan\" , \"i\" ) ) }"
            },
            "answers": [
                ""
            ]
        }
    ]
}