{
    "dataset": {
        "id": "coypu-kg-questions-train"
    },
    "questions": [
        {
            "id": "1273",
            "question": [
                {
                    "string": "How many news items have been made about Nigeria in August of 2038?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:News . ?var_1 coy:hasCountryLocation / rdfs:label 'Nigeria'@en . ?var_1 coy:hasTimestamp ?var_3 . filter ( ( year ( xsd:dateTime ( ?var_3 ) ) = 2038 ) && ( month ( xsd:dateTime ( ?var_3 ) ) = 08 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1274",
            "question": [
                {
                    "string": "How many articles have been published about Germany in September of 2039?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:News . ?var_1 coy:hasCountryLocation / rdfs:label 'Germany'@en . ?var_1 coy:hasTimestamp ?var_3 . filter ( ( year ( xsd:dateTime ( ?var_3 ) ) = 2039 ) && ( month ( xsd:dateTime ( ?var_3 ) ) = 09 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1275",
            "question": [
                {
                    "string": "How many news items have been reported about Brazil in October of 2040?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:News . ?var_1 coy:hasCountryLocation / rdfs:label 'Brazil'@en . ?var_1 coy:hasTimestamp ?var_3 . filter ( ( year ( xsd:dateTime ( ?var_3 ) ) = 2040 ) && ( month ( xsd:dateTime ( ?var_3 ) ) = 10 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1276",
            "question": [
                {
                    "string": "How many articles have been written about Australia in November of 2041?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:News . ?var_1 coy:hasCountryLocation / rdfs:label 'Australia'@en . ?var_1 coy:hasTimestamp ?var_3 . filter ( ( year ( xsd:dateTime ( ?var_3 ) ) = 2041 ) && ( month ( xsd:dateTime ( ?var_3 ) ) = 11 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1277",
            "question": [
                {
                    "string": "How many news items have been made about Japan in December of 2042?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:News . ?var_1 coy:hasCountryLocation / rdfs:label 'Japan'@en . ?var_1 coy:hasTimestamp ?var_3 . filter ( ( year ( xsd:dateTime ( ?var_3 ) ) = 2042 ) && ( month ( xsd:dateTime ( ?var_3 ) ) = 12 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1278",
            "question": [
                {
                    "string": "How many articles have been published about Ukraine in January of 2043?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:News . ?var_1 coy:hasCountryLocation / rdfs:label 'Ukraine'@en . ?var_1 coy:hasTimestamp ?var_3 . filter ( ( year ( xsd:dateTime ( ?var_3 ) ) = 2043 ) && ( month ( xsd:dateTime ( ?var_3 ) ) = 01 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1279",
            "question": [
                {
                    "string": "How many instances of chemical warfare occurred in Argentina in May of 2023?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasIsoCode ?var_3 . ?var_1 coy:hasTimestamp ?var_4 . ?var_5 rdf:type coy:Country . ?var_5 rdfs:label 'Argentina'@en . ?var_5 coy:hasIso3Code ?var_3 . filter ( ( year ( ?var_4 ) = 2023 ) && ( month ( ?var_4 ) = 05 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1280",
            "question": [
                {
                    "string": "How many chemical attacks took place in Australia in March of 2024?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasIsoCode ?var_3 . ?var_1 coy:hasTimestamp ?var_4 . ?var_5 rdf:type coy:Country . ?var_5 rdfs:label 'Australia'@en . ?var_5 coy:hasIso3Code ?var_3 . filter ( ( year ( ?var_4 ) = 2024 ) && ( month ( ?var_4 ) = 03 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1281",
            "question": [
                {
                    "string": "How many instances of chemical warfare occurred in Canada in June of 2025?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasIsoCode ?var_3 . ?var_1 coy:hasTimestamp ?var_4 . ?var_5 rdf:type coy:Country . ?var_5 rdfs:label 'Canada'@en . ?var_5 coy:hasIso3Code ?var_3 . filter ( ( year ( ?var_4 ) = 2025 ) && ( month ( ?var_4 ) = 06 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1282",
            "question": [
                {
                    "string": "How many chemical attacks took place in China in July of 2026?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasIsoCode ?var_3 . ?var_1 coy:hasTimestamp ?var_4 . ?var_5 rdf:type coy:Country . ?var_5 rdfs:label 'China'@en . ?var_5 coy:hasIso3Code ?var_3 . filter ( ( year ( ?var_4 ) = 2026 ) && ( month ( ?var_4 ) = 07 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1283",
            "question": [
                {
                    "string": "How many instances of chemical warfare occurred in France in August of 2027?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasIsoCode ?var_3 . ?var_1 coy:hasTimestamp ?var_4 . ?var_5 rdf:type coy:Country . ?var_5 rdfs:label 'France'@en . ?var_5 coy:hasIso3Code ?var_3 . filter ( ( year ( ?var_4 ) = 2027 ) && ( month ( ?var_4 ) = 08 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1284",
            "question": [
                {
                    "string": "How many chemical attacks took place in Germany in September of 2028?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasIsoCode ?var_3 . ?var_1 coy:hasTimestamp ?var_4 . ?var_5 rdf:type coy:Country . ?var_5 rdfs:label 'Germany'@en . ?var_5 coy:hasIso3Code ?var_3 . filter ( ( year ( ?var_4 ) = 2028 ) && ( month ( ?var_4 ) = 09 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1285",
            "question": [
                {
                    "string": "How many instances of chemical warfare occurred in India in October of 2029?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasIsoCode ?var_3 . ?var_1 coy:hasTimestamp ?var_4 . ?var_5 rdf:type coy:Country . ?var_5 rdfs:label 'India'@en . ?var_5 coy:hasIso3Code ?var_3 . filter ( ( year ( ?var_4 ) = 2029 ) && ( month ( ?var_4 ) = 10 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1286",
            "question": [
                {
                    "string": "How many chemical attacks took place in Italy in November of 2030?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasIsoCode ?var_3 . ?var_1 coy:hasTimestamp ?var_4 . ?var_5 rdf:type coy:Country . ?var_5 rdfs:label 'Italy'@en . ?var_5 coy:hasIso3Code ?var_3 . filter ( ( year ( ?var_4 ) = 2030 ) && ( month ( ?var_4 ) = 11 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1287",
            "question": [
                {
                    "string": "How many instances of chemical warfare occurred in Japan in December of 2031?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasIsoCode ?var_3 . ?var_1 coy:hasTimestamp ?var_4 . ?var_5 rdf:type coy:Country . ?var_5 rdfs:label 'Japan'@en . ?var_5 coy:hasIso3Code ?var_3 . filter ( ( year ( ?var_4 ) = 2031 ) && ( month ( ?var_4 ) = 12 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1288",
            "question": [
                {
                    "string": "How many chemical attacks took place in Mexico in January of 2032?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasIsoCode ?var_3 . ?var_1 coy:hasTimestamp ?var_4 . ?var_5 rdf:type coy:Country . ?var_5 rdfs:label 'Mexico'@en . ?var_5 coy:hasIso3Code ?var_3 . filter ( ( year ( ?var_4 ) = 2032 ) && ( month ( ?var_4 ) = 01 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1289",
            "question": [
                {
                    "string": "How many instances of chemical warfare occurred in Nigeria in February of 2033?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasIsoCode ?var_3 . ?var_1 coy:hasTimestamp ?var_4 . ?var_5 rdf:type coy:Country . ?var_5 rdfs:label 'Nigeria'@en . ?var_5 coy:hasIso3Code ?var_3 . filter ( ( year ( ?var_4 ) = 2033 ) && ( month ( ?var_4 ) = 02 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1290",
            "question": [
                {
                    "string": "How many chemical attacks took place in Russia in March of 2034?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasIsoCode ?var_3 . ?var_1 coy:hasTimestamp ?var_4 . ?var_5 rdf:type coy:Country . ?var_5 rdfs:label 'Russia'@en . ?var_5 coy:hasIso3Code ?var_3 . filter ( ( year ( ?var_4 ) = 2034 ) && ( month ( ?var_4 ) = 03 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1291",
            "question": [
                {
                    "string": "How many instances of chemical warfare occurred in South Africa in April of 2035?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasIsoCode ?var_3 . ?var_1 coy:hasTimestamp ?var_4 . ?var_5 rdf:type coy:Country . ?var_5 rdfs:label 'South Africa'@en . ?var_5 coy:hasIso3Code ?var_3 . filter ( ( year ( ?var_4 ) = 2035 ) && ( month ( ?var_4 ) = 04 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1292",
            "question": [
                {
                    "string": "How many chemical attacks took place in Spain in May of 2036?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasIsoCode ?var_3 . ?var_1 coy:hasTimestamp ?var_4 . ?var_5 rdf:type coy:Country . ?var_5 rdfs:label 'Spain'@en . ?var_5 coy:hasIso3Code ?var_3 . filter ( ( year ( ?var_4 ) = 2036 ) && ( month ( ?var_4 ) = 05 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1293",
            "question": [
                {
                    "string": "How many instances of chemical warfare occurred in United Kingdom in June of 2037?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasIsoCode ?var_3 . ?var_1 coy:hasTimestamp ?var_4 . ?var_5 rdf:type coy:Country . ?var_5 rdfs:label 'United Kingdom'@en . ?var_5 coy:hasIso3Code ?var_3 . filter ( ( year ( ?var_4 ) = 2037 ) && ( month ( ?var_4 ) = 06 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1294",
            "question": [
                {
                    "string": "How many chemical attacks took place in United States in July of 2038?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasIsoCode ?var_3 . ?var_1 coy:hasTimestamp ?var_4 . ?var_5 rdf:type coy:Country . ?var_5 rdfs:label 'United States'@en . ?var_5 coy:hasIso3Code ?var_3 . filter ( ( year ( ?var_4 ) = 2038 ) && ( month ( ?var_4 ) = 07 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1295",
            "question": [
                {
                    "string": "How many instances of chemical warfare occurred in Afghanistan in August of 2039?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasIsoCode ?var_3 . ?var_1 coy:hasTimestamp ?var_4 . ?var_5 rdf:type coy:Country . ?var_5 rdfs:label 'Afghanistan'@en . ?var_5 coy:hasIso3Code ?var_3 . filter ( ( year ( ?var_4 ) = 2039 ) && ( month ( ?var_4 ) = 08 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1296",
            "question": [
                {
                    "string": "How many chemical attacks took place in Iraq in September of 2040?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasIsoCode ?var_3 . ?var_1 coy:hasTimestamp ?var_4 . ?var_5 rdf:type coy:Country . ?var_5 rdfs:label 'Iraq'@en . ?var_5 coy:hasIso3Code ?var_3 . filter ( ( year ( ?var_4 ) = 2040 ) && ( month ( ?var_4 ) = 09 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1297",
            "question": [
                {
                    "string": "How many instances of chemical warfare occurred in Iran in October of 2041?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasIsoCode ?var_3 . ?var_1 coy:hasTimestamp ?var_4 . ?var_5 rdf:type coy:Country . ?var_5 rdfs:label 'Iran'@en . ?var_5 coy:hasIso3Code ?var_3 . filter ( ( year ( ?var_4 ) = 2041 ) && ( month ( ?var_4 ) = 10 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1298",
            "question": [
                {
                    "string": "How many chemical attacks took place in Pakistan in November of 2042?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasIsoCode ?var_3 . ?var_1 coy:hasTimestamp ?var_4 . ?var_5 rdf:type coy:Country . ?var_5 rdfs:label 'Pakistan'@en . ?var_5 coy:hasIso3Code ?var_3 . filter ( ( year ( ?var_4 ) = 2042 ) && ( month ( ?var_4 ) = 11 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1299",
            "question": [
                {
                    "string": "How many instances of chemical warfare occurred in Syria in December of 2043?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:ChemicalWeapon . ?var_1 coy:hasIsoCode ?var_3 . ?var_1 coy:hasTimestamp ?var_4 . ?var_5 rdf:type coy:Country . ?var_5 rdfs:label 'Syria'@en . ?var_5 coy:hasIso3Code ?var_3 . filter ( ( year ( ?var_4 ) = 2043 ) && ( month ( ?var_4 ) = 12 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1300",
            "question": [
                {
                    "string": "How many nuclear reactors are in France?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType 'Nuclear' . ?var_1 coy:hasCountryLocation / rdfs:label 'France'@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1301",
            "question": [
                {
                    "string": "How many atomic power stations are in Japan?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType 'Nuclear' . ?var_1 coy:hasCountryLocation / rdfs:label 'Japan'@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1302",
            "question": [
                {
                    "string": "How many nuclear energy facilities are in China?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType 'Nuclear' . ?var_1 coy:hasCountryLocation / rdfs:label 'China'@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1303",
            "question": [
                {
                    "string": "How many atomic power plants are in Russia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType 'Nuclear' . ?var_1 coy:hasCountryLocation / rdfs:label 'Russia'@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1304",
            "question": [
                {
                    "string": "How many nuclear reactors are in the United States?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType 'Nuclear' . ?var_1 coy:hasCountryLocation / rdfs:label 'United States'@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1305",
            "question": [
                {
                    "string": "How many atomic power stations are in Germany?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType 'Nuclear' . ?var_1 coy:hasCountryLocation / rdfs:label 'Germany'@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1306",
            "question": [
                {
                    "string": "How many nuclear energy facilities are in United Kingdom?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType 'Nuclear' . ?var_1 coy:hasCountryLocation / rdfs:label 'United Kingdom'@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1307",
            "question": [
                {
                    "string": "How many atomic power plants are in India?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType 'Nuclear' . ?var_1 coy:hasCountryLocation / rdfs:label 'India'@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1308",
            "question": [
                {
                    "string": "How many nuclear reactors are in South Korea?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType 'Nuclear' . ?var_1 coy:hasCountryLocation / rdfs:label 'South Korea'@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1309",
            "question": [
                {
                    "string": "How many atomic power stations are in Canada?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType 'Nuclear' . ?var_1 coy:hasCountryLocation / rdfs:label 'Canada'@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1310",
            "question": [
                {
                    "string": "How many nuclear energy facilities are in Spain?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType 'Nuclear' . ?var_1 coy:hasCountryLocation / rdfs:label 'Spain'@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1311",
            "question": [
                {
                    "string": "How many atomic power plants are in Sweden?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType 'Nuclear' . ?var_1 coy:hasCountryLocation / rdfs:label 'Sweden'@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1312",
            "question": [
                {
                    "string": "How many nuclear reactors are in Belgium?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType 'Nuclear' . ?var_1 coy:hasCountryLocation / rdfs:label 'Belgium'@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1313",
            "question": [
                {
                    "string": "How many atomic power stations are in Switzerland?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType 'Nuclear' . ?var_1 coy:hasCountryLocation / rdfs:label 'Switzerland'@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1314",
            "question": [
                {
                    "string": "How many nuclear energy facilities are in Finland?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType 'Nuclear' . ?var_1 coy:hasCountryLocation / rdfs:label 'Finland'@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1315",
            "question": [
                {
                    "string": "How many atomic power plants are in Brazil?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType 'Nuclear' . ?var_1 coy:hasCountryLocation / rdfs:label 'Brazil'@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1316",
            "question": [
                {
                    "string": "How many nuclear reactors are in Argentina?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType 'Nuclear' . ?var_1 coy:hasCountryLocation / rdfs:label 'Argentina'@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1317",
            "question": [
                {
                    "string": "How many atomic power stations are in Mexico?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType 'Nuclear' . ?var_1 coy:hasCountryLocation / rdfs:label 'Mexico'@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1318",
            "question": [
                {
                    "string": "How many nuclear energy facilities are in Pakistan?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Powerplant . ?var_1 coy:hasFuelType 'Nuclear' . ?var_1 coy:hasCountryLocation / rdfs:label 'Pakistan'@en }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1319",
            "question": [
                {
                    "string": "How many incidents occurred in Berlin in 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Attack . ?var_1 coy:hasLocation 'Berlin' . ?var_1 coy:hasTimestamp ?var_3 . filter ( year ( ?var_3 ) = 2022 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1320",
            "question": [
                {
                    "string": "How many events took place in Moscow in 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Attack . ?var_1 coy:hasLocation 'Moscow' . ?var_1 coy:hasTimestamp ?var_3 . filter ( year ( ?var_3 ) = 2022 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1321",
            "question": [
                {
                    "string": "How many occurrences happened in Paris in 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Attack . ?var_1 coy:hasLocation 'Paris' . ?var_1 coy:hasTimestamp ?var_3 . filter ( year ( ?var_3 ) = 2022 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1322",
            "question": [
                {
                    "string": "How many instances occurred in London in 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Attack . ?var_1 coy:hasLocation 'London' . ?var_1 coy:hasTimestamp ?var_3 . filter ( year ( ?var_3 ) = 2022 ) }"
            },
            "answers": [
                ""
            ]
        }
    ]
}