{
    "dataset": {
        "id": "coypu-kg-questions-train"
    },
    "questions": [
        {
            "id": "1167",
            "question": [
                {
                    "string": "Did a mishap occur in 2029 that impacted both China and India simultaneously?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ASK { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation ?var_3 , ?var_4 . ?var_3 rdf:type coy:Country . ?var_3 rdfs:label \"China\"@en . ?var_4 rdf:type coy:Country . ?var_4 skos:altLabel \"India\"@en . FILTER(YEAR(?var_2) = 2029) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1168",
            "question": [
                {
                    "string": "Did a crisis happen in 2030 that affected both Russia and Ukraine at the same time?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ASK { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation ?var_3 , ?var_4 . ?var_3 rdf:type coy:Country . ?var_3 rdfs:label \"Russia\"@en . ?var_4 rdf:type coy:Country . ?var_4 skos:altLabel \"Ukraine\"@en . FILTER(YEAR(?var_2) = 2030) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1169",
            "question": [
                {
                    "string": "Did an emergency happen in 2031 that struck both Mexico and Brazil simultaneously?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ASK { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation ?var_3 , ?var_4 . ?var_3 rdf:type coy:Country . ?var_3 rdfs:label \"Mexico\"@en . ?var_4 rdf:type coy:Country . ?var_4 skos:altLabel \"Brazil\"@en . FILTER(YEAR(?var_2) = 2031) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1170",
            "question": [
                {
                    "string": "Did a calamity occur in 2032 that impacted both Canada and United States at the same time?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ASK { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation ?var_3 , ?var_4 . ?var_3 rdf:type coy:Country . ?var_3 rdfs:label \"Canada\"@en . ?var_4 rdf:type coy:Country . ?var_4 skos:altLabel \"United States\"@en . FILTER(YEAR(?var_2) = 2032) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1171",
            "question": [
                {
                    "string": "Did a tragedy happen in 2033 that affected both Australia and New Zealand simultaneously?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ASK { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation ?var_3 , ?var_4 . ?var_3 rdf:type coy:Country . ?var_3 rdfs:label \"Australia\"@en . ?var_4 rdf:type coy:Country . ?var_4 skos:altLabel \"New Zealand\"@en . FILTER(YEAR(?var_2) = 2033) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1172",
            "question": [
                {
                    "string": "Did an incident happen in 2034 that affected both United Kingdom and Ireland at the same time?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ASK { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation ?var_3 , ?var_4 . ?var_3 rdf:type coy:Country . ?var_3 rdfs:label \"United Kingdom\"@en . ?var_4 rdf:type coy:Country . ?var_4 skos:altLabel \"Ireland\"@en . FILTER(YEAR(?var_2) = 2034) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1173",
            "question": [
                {
                    "string": "Did a calamity occur in 2035 that impacted both Japan and South Korea simultaneously?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ASK { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation ?var_3 , ?var_4 . ?var_3 rdf:type coy:Country . ?var_3 rdfs:label \"Japan\"@en . ?var_4 rdf:type coy:Country . ?var_4 skos:altLabel \"South Korea\"@en . FILTER(YEAR(?var_2) = 2035) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1174",
            "question": [
                {
                    "string": "Did a catastrophe occur in 2036 that impacted both Brazil and Argentina simultaneously?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ASK { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation ?var_3 , ?var_4 . ?var_3 rdf:type coy:Country . ?var_3 rdfs:label \"Brazil\"@en . ?var_4 rdf:type coy:Country . ?var_4 skos:altLabel \"Argentina\"@en . FILTER(YEAR(?var_2) = 2036) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1175",
            "question": [
                {
                    "string": "Did a catastrophe occur in 2037 that impacted both China and India simultaneously?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ASK { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation ?var_3 , ?var_4 . ?var_3 rdf:type coy:Country . ?var_3 rdfs:label \"China\"@en . ?var_4 rdf:type coy:Country . ?var_4 skos:altLabel \"India\"@en . FILTER(YEAR(?var_2) = 2037) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1176",
            "question": [
                {
                    "string": "Did a tragedy happen in 2038 that affected both Russia and Ukraine at the same time?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ASK { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation ?var_3 , ?var_4 . ?var_3 rdf:type coy:Country . ?var_3 rdfs:label \"Russia\"@en . ?var_4 rdf:type coy:Country . ?var_4 skos:altLabel \"Ukraine\"@en . FILTER(YEAR(?var_2) = 2038) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1177",
            "question": [
                {
                    "string": "Did an emergency happen in 2039 that struck both Mexico and Brazil simultaneously?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ASK { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation ?var_3 , ?var_4 . ?var_3 rdf:type coy:Country . ?var_3 rdfs:label \"Mexico\"@en . ?var_4 rdf:type coy:Country . ?var_4 skos:altLabel \"Brazil\"@en . FILTER(YEAR(?var_2) = 2039) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1178",
            "question": [
                {
                    "string": "Did a crisis happen in 2040 that affected both Canada and United States at the same time?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ASK { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation ?var_3 , ?var_4 . ?var_3 rdf:type coy:Country . ?var_3 rdfs:label \"Canada\"@en . ?var_4 rdf:type coy:Country . ?var_4 skos:altLabel \"United States\"@en . FILTER(YEAR(?var_2) = 2040) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1179",
            "question": [
                {
                    "string": "Did a mishap occur in 2041 that affected both Australia and New Zealand simultaneously?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ASK { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation ?var_3 , ?var_4 . ?var_3 rdf:type coy:Country . ?var_3 rdfs:label \"Australia\"@en . ?var_4 rdf:type coy:Country . ?var_4 skos:altLabel \"New Zealand\"@en . FILTER(YEAR(?var_2) = 2041) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1180",
            "question": [
                {
                    "string": "When was the latest piece of news about France published on 'bloomberg.com'?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'France'@en . ?var_2 coy:hasTimestamp ?var_1 . ?var_2 coy:hasUrl ?var_3 . filter ( regex ( ?var_3 , 'bloomberg.com' ) ) } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1181",
            "question": [
                {
                    "string": "When was the latest piece of news about China published on 'bloomberg.com'?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'China'@en . ?var_2 coy:hasTimestamp ?var_1 . ?var_2 coy:hasUrl ?var_3 . filter ( regex ( ?var_3 , 'bloomberg.com' ) ) } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1182",
            "question": [
                {
                    "string": "When was the latest piece of news about Japan published on 'bloomberg.com'?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'Japan'@en . ?var_2 coy:hasTimestamp ?var_1 . ?var_2 coy:hasUrl ?var_3 . filter ( regex ( ?var_3 , 'bloomberg.com' ) ) } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1183",
            "question": [
                {
                    "string": "When was the latest piece of news about Germany published on 'bloomberg.com'?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'Germany'@en . ?var_2 coy:hasTimestamp ?var_1 . ?var_2 coy:hasUrl ?var_3 . filter ( regex ( ?var_3 , 'bloomberg.com' ) ) } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1184",
            "question": [
                {
                    "string": "When was the latest piece of news about Italy published on 'bloomberg.com'?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'Italy'@en . ?var_2 coy:hasTimestamp ?var_1 . ?var_2 coy:hasUrl ?var_3 . filter ( regex ( ?var_3 , 'bloomberg.com' ) ) } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1185",
            "question": [
                {
                    "string": "When was the latest piece of news about India published on 'bloomberg.com'?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'India'@en . ?var_2 coy:hasTimestamp ?var_1 . ?var_2 coy:hasUrl ?var_3 . filter ( regex ( ?var_3 , 'bloomberg.com' ) ) } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1186",
            "question": [
                {
                    "string": "When was the latest piece of news about Brazil published on 'bloomberg.com'?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'Brazil'@en . ?var_2 coy:hasTimestamp ?var_1 . ?var_2 coy:hasUrl ?var_3 . filter ( regex ( ?var_3 , 'bloomberg.com' ) ) } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1187",
            "question": [
                {
                    "string": "When was the latest piece of news about Australia published on 'bloomberg.com'?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'Australia'@en . ?var_2 coy:hasTimestamp ?var_1 . ?var_2 coy:hasUrl ?var_3 . filter ( regex ( ?var_3 , 'bloomberg.com' ) ) } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1188",
            "question": [
                {
                    "string": "When was the latest piece of news about Canada published on 'bloomberg.com'?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'Canada'@en . ?var_2 coy:hasTimestamp ?var_1 . ?var_2 coy:hasUrl ?var_3 . filter ( regex ( ?var_3 , 'bloomberg.com' ) ) } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1189",
            "question": [
                {
                    "string": "When was the latest piece of news about Mexico published on 'bloomberg.com'?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'Mexico'@en . ?var_2 coy:hasTimestamp ?var_1 . ?var_2 coy:hasUrl ?var_3 . filter ( regex ( ?var_3 , 'bloomberg.com' ) ) } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1190",
            "question": [
                {
                    "string": "When was the latest piece of news about Spain published on 'bloomberg.com'?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'Spain'@en . ?var_2 coy:hasTimestamp ?var_1 . ?var_2 coy:hasUrl ?var_3 . filter ( regex ( ?var_3 , 'bloomberg.com' ) ) } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1191",
            "question": [
                {
                    "string": "When was the latest piece of news about United Kingdom published on 'bloomberg.com'?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'United Kingdom'@en . ?var_2 coy:hasTimestamp ?var_1 . ?var_2 coy:hasUrl ?var_3 . filter ( regex ( ?var_3 , 'bloomberg.com' ) ) } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1192",
            "question": [
                {
                    "string": "When was the latest piece of news about United States published on 'bloomberg.com'?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'United States'@en . ?var_2 coy:hasTimestamp ?var_1 . ?var_2 coy:hasUrl ?var_3 . filter ( regex ( ?var_3 , 'bloomberg.com' ) ) } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1193",
            "question": [
                {
                    "string": "When was the latest piece of news about Turkey published on 'bloomberg.com'?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'Turkey'@en . ?var_2 coy:hasTimestamp ?var_1 . ?var_2 coy:hasUrl ?var_3 . filter ( regex ( ?var_3 , 'bloomberg.com' ) ) } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1194",
            "question": [
                {
                    "string": "When was the latest piece of news about South Korea published on 'bloomberg.com'?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'South Korea'@en . ?var_2 coy:hasTimestamp ?var_1 . ?var_2 coy:hasUrl ?var_3 . filter ( regex ( ?var_3 , 'bloomberg.com' ) ) } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1195",
            "question": [
                {
                    "string": "When was the latest piece of news about Saudi Arabia published on 'bloomberg.com'?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'Saudi Arabia'@en . ?var_2 coy:hasTimestamp ?var_1 . ?var_2 coy:hasUrl ?var_3 . filter ( regex ( ?var_3 , 'bloomberg.com' ) ) } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1196",
            "question": [
                {
                    "string": "When was the latest piece of news about Iran published on 'bloomberg.com'?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'Iran'@en . ?var_2 coy:hasTimestamp ?var_1 . ?var_2 coy:hasUrl ?var_3 . filter ( regex ( ?var_3 , 'bloomberg.com' ) ) } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1197",
            "question": [
                {
                    "string": "When was the latest piece of news about Iraq published on 'bloomberg.com'?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'Iraq'@en . ?var_2 coy:hasTimestamp ?var_1 . ?var_2 coy:hasUrl ?var_3 . filter ( regex ( ?var_3 , 'bloomberg.com' ) ) } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1198",
            "question": [
                {
                    "string": "When was the latest piece of news about Egypt published on 'bloomberg.com'?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'Egypt'@en . ?var_2 coy:hasTimestamp ?var_1 . ?var_2 coy:hasUrl ?var_3 . filter ( regex ( ?var_3 , 'bloomberg.com' ) ) } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1199",
            "question": [
                {
                    "string": "How many small companies operate in France?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label \"France\"@en . ?var_1 coy:hasCompanySize \"SMALL\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1200",
            "question": [
                {
                    "string": "How many micro companies are based in Italy?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label \"Italy\"@en . ?var_1 coy:hasCompanySize \"MICRO\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1201",
            "question": [
                {
                    "string": "What is the number of medium-sized companies located in Spain?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label \"Spain\"@en . ?var_1 coy:hasCompanySize \"MEDIUM\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1202",
            "question": [
                {
                    "string": "How many micro companies have their base in United Kingdom?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label \"United Kingdom\"@en . ?var_1 coy:hasCompanySize \"MICRO\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1203",
            "question": [
                {
                    "string": "What is the count of small companies in Switzerland?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label \"Switzerland\"@en . ?var_1 coy:hasCompanySize \"SMALL\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1204",
            "question": [
                {
                    "string": "How many small businesses are established in Netherlands?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label \"Netherlands\"@en . ?var_1 coy:hasCompanySize \"SMALL\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1205",
            "question": [
                {
                    "string": "What is the number of micro companies based in Belgium?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label \"Belgium\"@en . ?var_1 coy:hasCompanySize \"MICRO\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1206",
            "question": [
                {
                    "string": "How many micro businesses operate in Austria?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label \"Austria\"@en . ?var_1 coy:hasCompanySize \"MICRO\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1207",
            "question": [
                {
                    "string": "What is the count of medium-sized businesses in Luxembourg?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label \"Luxembourg\"@en . ?var_1 coy:hasCompanySize \"MEDIUM\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1208",
            "question": [
                {
                    "string": "How many small businesses have their base in Portugal?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label \"Portugal\"@en . ?var_1 coy:hasCompanySize \"SMALL\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1209",
            "question": [
                {
                    "string": "What is the number of small companies located in Denmark?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label \"Denmark\"@en . ?var_1 coy:hasCompanySize \"SMALL\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1210",
            "question": [
                {
                    "string": "How many medium-sized enterprises are based in Sweden?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label \"Sweden\"@en . ?var_1 coy:hasCompanySize \"MEDIUM\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1211",
            "question": [
                {
                    "string": "What is the count of small businesses in Finland?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label \"Finland\"@en . ?var_1 coy:hasCompanySize \"SMALL\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1212",
            "question": [
                {
                    "string": "How many micro businesses operate in Norway?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label \"Norway\"@en . ?var_1 coy:hasCompanySize \"MICRO\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1213",
            "question": [
                {
                    "string": "What is the number of small businesses based in Ireland?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label \"Ireland\"@en . ?var_1 coy:hasCompanySize \"SMALL\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1214",
            "question": [
                {
                    "string": "How many small businesses have their base in Spain?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label \"Spain\"@en . ?var_1 coy:hasCompanySize \"SMALL\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1215",
            "question": [
                {
                    "string": "What is the count of micro companies in Greece?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label \"Greece\"@en . ?var_1 coy:hasCompanySize \"MICRO\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1216",
            "question": [
                {
                    "string": "How many micro businesses operate in Switzerland?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label \"Switzerland\"@en . ?var_1 coy:hasCompanySize \"MICRO\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1217",
            "question": [
                {
                    "string": "What is the number of micro enterprises based in Austria?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCountryLocation / rdfs:label \"Austria\"@en . ?var_1 coy:hasCompanySize \"MICRO\" . }"
            },
            "answers": [
                ""
            ]
        }
    ]
}