{
    "dataset": {
        "id": "coypu-kg-questions-train"
    },
    "questions": [
        {
            "id": "1218",
            "question": [
                {
                    "string": "Is there at least one Company in the Main Street?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasStreet ?var_2 . filter ( regex ( ?var_2 , \"Main Street\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1219",
            "question": [
                {
                    "string": "Does any Company exist on Park Avenue?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasStreet ?var_2 . filter ( regex ( ?var_2 , \"Park Avenue\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1220",
            "question": [
                {
                    "string": "Is there at least one Company in the Broadway?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasStreet ?var_2 . filter ( regex ( ?var_2 , \"Broadway\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1221",
            "question": [
                {
                    "string": "Does any Company operate on Oak Street?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasStreet ?var_2 . filter ( regex ( ?var_2 , \"Oak Street\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1222",
            "question": [
                {
                    "string": "Is there at least one Company in the Elm Street?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasStreet ?var_2 . filter ( regex ( ?var_2 , \"Elm Street\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1223",
            "question": [
                {
                    "string": "Does any Company exist on Maple Avenue?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasStreet ?var_2 . filter ( regex ( ?var_2 , \"Maple Avenue\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1224",
            "question": [
                {
                    "string": "Is there at least one Company in the Cedar Lane?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasStreet ?var_2 . filter ( regex ( ?var_2 , \"Cedar Lane\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1225",
            "question": [
                {
                    "string": "Does any Company operate on Pine Street?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasStreet ?var_2 . filter ( regex ( ?var_2 , \"Pine Street\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1226",
            "question": [
                {
                    "string": "Is there at least one Company in the Willow Avenue?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasStreet ?var_2 . filter ( regex ( ?var_2 , \"Willow Avenue\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1227",
            "question": [
                {
                    "string": "Does any Company exist on Cherry Lane?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasStreet ?var_2 . filter ( regex ( ?var_2 , \"Cherry Lane\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1228",
            "question": [
                {
                    "string": "Is there at least one Company in the Chestnut Street?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasStreet ?var_2 . filter ( regex ( ?var_2 , \"Chestnut Street\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1229",
            "question": [
                {
                    "string": "Does any Company operate on Sycamore Avenue?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasStreet ?var_2 . filter ( regex ( ?var_2 , \"Sycamore Avenue\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1230",
            "question": [
                {
                    "string": "Is there at least one Company in the Walnut Lane?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasStreet ?var_2 . filter ( regex ( ?var_2 , \"Walnut Lane\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1231",
            "question": [
                {
                    "string": "Does any Company exist on Birch Street?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasStreet ?var_2 . filter ( regex ( ?var_2 , \"Birch Street\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1232",
            "question": [
                {
                    "string": "Is there at least one Company in the Poplar Avenue?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasStreet ?var_2 . filter ( regex ( ?var_2 , \"Poplar Avenue\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1233",
            "question": [
                {
                    "string": "Does any Company operate on Hickory Lane?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasStreet ?var_2 . filter ( regex ( ?var_2 , \"Hickory Lane\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1234",
            "question": [
                {
                    "string": "Is there at least one Company in the Magnolia Street?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasStreet ?var_2 . filter ( regex ( ?var_2 , \"Magnolia Street\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1235",
            "question": [
                {
                    "string": "Does any Company exist on Palm Avenue?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasStreet ?var_2 . filter ( regex ( ?var_2 , \"Palm Avenue\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1236",
            "question": [
                {
                    "string": "Is there at least one Company in the Juniper Lane?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasStreet ?var_2 . filter ( regex ( ?var_2 , \"Juniper Lane\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1237",
            "question": [
                {
                    "string": "Does any Company operate on Cypress Street?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Company . ?var_1 coy:hasStreet ?var_2 . filter ( regex ( ?var_2 , \"Cypress Street\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1238",
            "question": [
                {
                    "string": "Which country faced the most earthquakes in 2021?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Earthquake . ?var_2 coy:hasTimestamp ?var_3 . ?var_2 coy:hasCountryLocation / rdfs:label ?var_1 . filter ( year ( xsd:dateTime ( ?var_3 ) ) = 2021 ) } group by ( ?var_1 ) order by desc ( count ( distinct ?var_2 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1239",
            "question": [
                {
                    "string": "Which country experienced the highest number of hurricanes in 2022?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Hurricane . ?var_2 coy:hasTimestamp ?var_3 . ?var_2 coy:hasCountryLocation / rdfs:label ?var_1 . filter ( year ( xsd:dateTime ( ?var_3 ) ) = 2022 ) } group by ( ?var_1 ) order by desc ( count ( distinct ?var_2 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1240",
            "question": [
                {
                    "string": "What was the most recent piece of news relevant to Kenya about?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'Kenya'@en . ?var_2 coy:hasDescription ?var_1 . ?var_2 coy:hasTimestamp ?var_3 . } order by desc ( xsd:dateTime ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1241",
            "question": [
                {
                    "string": "What was the latest announcement related to Japan about?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'Japan'@en . ?var_2 coy:hasDescription ?var_1 . ?var_2 coy:hasTimestamp ?var_3 . } order by desc ( xsd:dateTime ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1242",
            "question": [
                {
                    "string": "What was the recent update regarding Brazil?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'Brazil'@en . ?var_2 coy:hasDescription ?var_1 . ?var_2 coy:hasTimestamp ?var_3 . } order by desc ( xsd:dateTime ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1243",
            "question": [
                {
                    "string": "What was the most recent piece of information relevant to Spain about?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'Spain'@en . ?var_2 coy:hasDescription ?var_1 . ?var_2 coy:hasTimestamp ?var_3 . } order by desc ( xsd:dateTime ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1244",
            "question": [
                {
                    "string": "What was the latest news concerning India?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'India'@en . ?var_2 coy:hasDescription ?var_1 . ?var_2 coy:hasTimestamp ?var_3 . } order by desc ( xsd:dateTime ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1245",
            "question": [
                {
                    "string": "What was the most recent update pertaining to Australia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'Australia'@en . ?var_2 coy:hasDescription ?var_1 . ?var_2 coy:hasTimestamp ?var_3 . } order by desc ( xsd:dateTime ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1246",
            "question": [
                {
                    "string": "What was the latest piece of news related to China?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'China'@en . ?var_2 coy:hasDescription ?var_1 . ?var_2 coy:hasTimestamp ?var_3 . } order by desc ( xsd:dateTime ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1247",
            "question": [
                {
                    "string": "What was the recent announcement concerning Canada?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'Canada'@en . ?var_2 coy:hasDescription ?var_1 . ?var_2 coy:hasTimestamp ?var_3 . } order by desc ( xsd:dateTime ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1248",
            "question": [
                {
                    "string": "What was the most recent update relevant to Germany?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'Germany'@en . ?var_2 coy:hasDescription ?var_1 . ?var_2 coy:hasTimestamp ?var_3 . } order by desc ( xsd:dateTime ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1249",
            "question": [
                {
                    "string": "What was the latest piece of information regarding Russia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'Russia'@en . ?var_2 coy:hasDescription ?var_1 . ?var_2 coy:hasTimestamp ?var_3 . } order by desc ( xsd:dateTime ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1250",
            "question": [
                {
                    "string": "What was the recent news about South Africa?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'South Africa'@en . ?var_2 coy:hasDescription ?var_1 . ?var_2 coy:hasTimestamp ?var_3 . } order by desc ( xsd:dateTime ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1251",
            "question": [
                {
                    "string": "What was the most recent update concerning Mexico?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'Mexico'@en . ?var_2 coy:hasDescription ?var_1 . ?var_2 coy:hasTimestamp ?var_3 . } order by desc ( xsd:dateTime ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1252",
            "question": [
                {
                    "string": "What was the latest piece of news related to Argentina?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'Argentina'@en . ?var_2 coy:hasDescription ?var_1 . ?var_2 coy:hasTimestamp ?var_3 . } order by desc ( xsd:dateTime ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1253",
            "question": [
                {
                    "string": "What was the recent update about France?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'France'@en . ?var_2 coy:hasDescription ?var_1 . ?var_2 coy:hasTimestamp ?var_3 . } order by desc ( xsd:dateTime ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1254",
            "question": [
                {
                    "string": "What was the most recent piece of information relevant to Italy?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'Italy'@en . ?var_2 coy:hasDescription ?var_1 . ?var_2 coy:hasTimestamp ?var_3 . } order by desc ( xsd:dateTime ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1255",
            "question": [
                {
                    "string": "What was the latest announcement concerning United Kingdom?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'United Kingdom'@en . ?var_2 coy:hasDescription ?var_1 . ?var_2 coy:hasTimestamp ?var_3 . } order by desc ( xsd:dateTime ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1256",
            "question": [
                {
                    "string": "What was the recent update related to Nigeria?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'Nigeria'@en . ?var_2 coy:hasDescription ?var_1 . ?var_2 coy:hasTimestamp ?var_3 . } order by desc ( xsd:dateTime ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1257",
            "question": [
                {
                    "string": "What was the most recent news about Saudi Arabia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:News . ?var_2 coy:hasCountryLocation / rdfs:label 'Saudi Arabia'@en . ?var_2 coy:hasDescription ?var_1 . ?var_2 coy:hasTimestamp ?var_3 . } order by desc ( xsd:dateTime ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1258",
            "question": [
                {
                    "string": "How many articles have been published about France in August of 2023?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:News . ?var_1 coy:hasCountryLocation / rdfs:label 'France'@en . ?var_1 coy:hasTimestamp ?var_3 . filter ( ( year ( xsd:dateTime ( ?var_3 ) ) = 2023 ) && ( month ( xsd:dateTime ( ?var_3 ) ) = 08 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1259",
            "question": [
                {
                    "string": "How many news items have been reported about Australia in April of 2024?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:News . ?var_1 coy:hasCountryLocation / rdfs:label 'Australia'@en . ?var_1 coy:hasTimestamp ?var_3 . filter ( ( year ( xsd:dateTime ( ?var_3 ) ) = 2024 ) && ( month ( xsd:dateTime ( ?var_3 ) ) = 04 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1260",
            "question": [
                {
                    "string": "How many articles have been written about Japan in October of 2025?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:News . ?var_1 coy:hasCountryLocation / rdfs:label 'Japan'@en . ?var_1 coy:hasTimestamp ?var_3 . filter ( ( year ( xsd:dateTime ( ?var_3 ) ) = 2025 ) && ( month ( xsd:dateTime ( ?var_3 ) ) = 10 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1261",
            "question": [
                {
                    "string": "How many news items have been made about Brazil in February of 2026?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:News . ?var_1 coy:hasCountryLocation / rdfs:label 'Brazil'@en . ?var_1 coy:hasTimestamp ?var_3 . filter ( ( year ( xsd:dateTime ( ?var_3 ) ) = 2026 ) && ( month ( xsd:dateTime ( ?var_3 ) ) = 02 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1262",
            "question": [
                {
                    "string": "How many articles have been published about Germany in May of 2027?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:News . ?var_1 coy:hasCountryLocation / rdfs:label 'Germany'@en . ?var_1 coy:hasTimestamp ?var_3 . filter ( ( year ( xsd:dateTime ( ?var_3 ) ) = 2027 ) && ( month ( xsd:dateTime ( ?var_3 ) ) = 05 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1263",
            "question": [
                {
                    "string": "How many news items have been reported about India in July of 2028?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:News . ?var_1 coy:hasCountryLocation / rdfs:label 'India'@en . ?var_1 coy:hasTimestamp ?var_3 . filter ( ( year ( xsd:dateTime ( ?var_3 ) ) = 2028 ) && ( month ( xsd:dateTime ( ?var_3 ) ) = 07 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1264",
            "question": [
                {
                    "string": "How many articles have been written about China in September of 2029?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:News . ?var_1 coy:hasCountryLocation / rdfs:label 'China'@en . ?var_1 coy:hasTimestamp ?var_3 . filter ( ( year ( xsd:dateTime ( ?var_3 ) ) = 2029 ) && ( month ( xsd:dateTime ( ?var_3 ) ) = 09 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1265",
            "question": [
                {
                    "string": "How many news items have been made about Canada in November of 2030?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:News . ?var_1 coy:hasCountryLocation / rdfs:label 'Canada'@en . ?var_1 coy:hasTimestamp ?var_3 . filter ( ( year ( xsd:dateTime ( ?var_3 ) ) = 2030 ) && ( month ( xsd:dateTime ( ?var_3 ) ) = 11 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1266",
            "question": [
                {
                    "string": "How many articles have been published about United States in January of 2031?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:News . ?var_1 coy:hasCountryLocation / rdfs:label 'United States'@en . ?var_1 coy:hasTimestamp ?var_3 . filter ( ( year ( xsd:dateTime ( ?var_3 ) ) = 2031 ) && ( month ( xsd:dateTime ( ?var_3 ) ) = 01 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1267",
            "question": [
                {
                    "string": "How many news items have been reported about United Kingdom in March of 2032?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:News . ?var_1 coy:hasCountryLocation / rdfs:label 'United Kingdom'@en . ?var_1 coy:hasTimestamp ?var_3 . filter ( ( year ( xsd:dateTime ( ?var_3 ) ) = 2032 ) && ( month ( xsd:dateTime ( ?var_3 ) ) = 03 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1268",
            "question": [
                {
                    "string": "How many articles have been written about Russia in December of 2033?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:News . ?var_1 coy:hasCountryLocation / rdfs:label 'Russia'@en . ?var_1 coy:hasTimestamp ?var_3 . filter ( ( year ( xsd:dateTime ( ?var_3 ) ) = 2033 ) && ( month ( xsd:dateTime ( ?var_3 ) ) = 12 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1269",
            "question": [
                {
                    "string": "How many news items have been made about Italy in April of 2034?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:News . ?var_1 coy:hasCountryLocation / rdfs:label 'Italy'@en . ?var_1 coy:hasTimestamp ?var_3 . filter ( ( year ( xsd:dateTime ( ?var_3 ) ) = 2034 ) && ( month ( xsd:dateTime ( ?var_3 ) ) = 04 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1270",
            "question": [
                {
                    "string": "How many articles have been published about Spain in May of 2035?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:News . ?var_1 coy:hasCountryLocation / rdfs:label 'Spain'@en . ?var_1 coy:hasTimestamp ?var_3 . filter ( ( year ( xsd:dateTime ( ?var_3 ) ) = 2035 ) && ( month ( xsd:dateTime ( ?var_3 ) ) = 05 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1271",
            "question": [
                {
                    "string": "How many news items have been reported about South Africa in June of 2036?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:News . ?var_1 coy:hasCountryLocation / rdfs:label 'South Africa'@en . ?var_1 coy:hasTimestamp ?var_3 . filter ( ( year ( xsd:dateTime ( ?var_3 ) ) = 2036 ) && ( month ( xsd:dateTime ( ?var_3 ) ) = 06 ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1272",
            "question": [
                {
                    "string": "How many articles have been written about Argentina in July of 2037?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:News . ?var_1 coy:hasCountryLocation / rdfs:label 'Argentina'@en . ?var_1 coy:hasTimestamp ?var_3 . filter ( ( year ( xsd:dateTime ( ?var_3 ) ) = 2037 ) && ( month ( xsd:dateTime ( ?var_3 ) ) = 07 ) ) }"
            },
            "answers": [
                ""
            ]
        }
    ]
}