{
    "dataset": {
        "id": "coypu-kg-questions-train"
    },
    "questions": [
        {
            "id": "1000",
            "question": [
                {
                    "string": "Did any natural disaster occur in Japan on 2022-05-15?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 ?var_2 ?var_3 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation / rdfs:label \"Japan\"@en . ?var_1 coy:hasTimestamp ?var_2 . bind ( xsd:date ( ?var_2 ) as ?var_4 ) filter ( ?var_4 = xsd:date ( \"2022-05-15+00:00\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1001",
            "question": [
                {
                    "string": "Was there an ongoing natural disaster in France on 2023-11-30?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 ?var_2 ?var_3 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation / rdfs:label \"France\"@en . ?var_1 coy:hasTimestamp ?var_2 . bind ( xsd:date ( ?var_2 ) as ?var_4 ) filter ( ?var_4 = xsd:date ( \"2023-11-30+00:00\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1002",
            "question": [
                {
                    "string": "Did a natural disaster take place in China on 2020-08-25?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 ?var_2 ?var_3 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation / rdfs:label \"China\"@en . ?var_1 coy:hasTimestamp ?var_2 . bind ( xsd:date ( ?var_2 ) as ?var_4 ) filter ( ?var_4 = xsd:date ( \"2020-08-25+00:00\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1003",
            "question": [
                {
                    "string": "Was there any active disaster in Italy on 2024-02-10?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 ?var_2 ?var_3 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation / rdfs:label \"Italy\"@en . ?var_1 coy:hasTimestamp ?var_2 . bind ( xsd:date ( ?var_2 ) as ?var_4 ) filter ( ?var_4 = xsd:date ( \"2024-02-10+00:00\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1004",
            "question": [
                {
                    "string": "Was there any recent natural disaster in Australia on 2023-07-20?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 ?var_2 ?var_3 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation / rdfs:label \"Australia\"@en . ?var_1 coy:hasTimestamp ?var_2 . bind ( xsd:date ( ?var_2 ) as ?var_4 ) filter ( ?var_4 = xsd:date ( \"2023-07-20+00:00\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1005",
            "question": [
                {
                    "string": "Did a natural disaster occur in India on 2022-09-05?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 ?var_2 ?var_3 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation / rdfs:label \"India\"@en . ?var_1 coy:hasTimestamp ?var_2 . bind ( xsd:date ( ?var_2 ) as ?var_4 ) filter ( ?var_4 = xsd:date ( \"2022-09-05+00:00\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1006",
            "question": [
                {
                    "string": "Did any disaster occur in Brazil on 2021-03-25?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 ?var_2 ?var_3 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation / rdfs:label \"Brazil\"@en . ?var_1 coy:hasTimestamp ?var_2 . bind ( xsd:date ( ?var_2 ) as ?var_4 ) filter ( ?var_4 = xsd:date ( \"2021-03-25+00:00\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1007",
            "question": [
                {
                    "string": "Was there any ongoing disaster in Russia on 2020-12-10?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 ?var_2 ?var_3 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation / rdfs:label \"Russia\"@en . ?var_1 coy:hasTimestamp ?var_2 . bind ( xsd:date ( ?var_2 ) as ?var_4 ) filter ( ?var_4 = xsd:date ( \"2020-12-10+00:00\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1008",
            "question": [
                {
                    "string": "Did any natural disaster occur in Canada on 2024-01-15?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 ?var_2 ?var_3 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation / rdfs:label \"Canada\"@en . ?var_1 coy:hasTimestamp ?var_2 . bind ( xsd:date ( ?var_2 ) as ?var_4 ) filter ( ?var_4 = xsd:date ( \"2024-01-15+00:00\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1009",
            "question": [
                {
                    "string": "Was there an active disaster in Spain on 2023-06-20?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 ?var_2 ?var_3 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation / rdfs:label \"Spain\"@en . ?var_1 coy:hasTimestamp ?var_2 . bind ( xsd:date ( ?var_2 ) as ?var_4 ) filter ( ?var_4 = xsd:date ( \"2023-06-20+00:00\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1010",
            "question": [
                {
                    "string": "Did any disaster occur in Germany on 2022-04-30?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 ?var_2 ?var_3 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation / rdfs:label \"Germany\"@en . ?var_1 coy:hasTimestamp ?var_2 . bind ( xsd:date ( ?var_2 ) as ?var_4 ) filter ( ?var_4 = xsd:date ( \"2022-04-30+00:00\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1011",
            "question": [
                {
                    "string": "Was there an ongoing natural disaster in Mexico on 2021-08-05?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 ?var_2 ?var_3 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation / rdfs:label \"Mexico\"@en . ?var_1 coy:hasTimestamp ?var_2 . bind ( xsd:date ( ?var_2 ) as ?var_4 ) filter ( ?var_4 = xsd:date ( \"2021-08-05+00:00\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1012",
            "question": [
                {
                    "string": "Did any natural disaster take place in Argentina on 2020-07-10?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 ?var_2 ?var_3 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation / rdfs:label \"Argentina\"@en . ?var_1 coy:hasTimestamp ?var_2 . bind ( xsd:date ( ?var_2 ) as ?var_4 ) filter ( ?var_4 = xsd:date ( \"2020-07-10+00:00\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1013",
            "question": [
                {
                    "string": "Was there any recent disaster in South Korea on 2023-09-15?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 ?var_2 ?var_3 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation / rdfs:label \"South Korea\"@en . ?var_1 coy:hasTimestamp ?var_2 . bind ( xsd:date ( ?var_2 ) as ?var_4 ) filter ( ?var_4 = xsd:date ( \"2023-09-15+00:00\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1014",
            "question": [
                {
                    "string": "Did a recent natural disaster occur in United Kingdom on 2024-02-20?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 ?var_2 ?var_3 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation / rdfs:label \"United Kingdom\"@en . ?var_1 coy:hasTimestamp ?var_2 . bind ( xsd:date ( ?var_2 ) as ?var_4 ) filter ( ?var_4 = xsd:date ( \"2024-02-20+00:00\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1015",
            "question": [
                {
                    "string": "Was there an active disaster in Indonesia on 2021-10-25?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 ?var_2 ?var_3 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation / rdfs:label \"Indonesia\"@en . ?var_1 coy:hasTimestamp ?var_2 . bind ( xsd:date ( ?var_2 ) as ?var_4 ) filter ( ?var_4 = xsd:date ( \"2021-10-25+00:00\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1016",
            "question": [
                {
                    "string": "Was there any active disaster in Turkey on 2022-12-30?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 ?var_2 ?var_3 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation / rdfs:label \"Turkey\"@en . ?var_1 coy:hasTimestamp ?var_2 . bind ( xsd:date ( ?var_2 ) as ?var_4 ) filter ( ?var_4 = xsd:date ( \"2022-12-30+00:00\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1017",
            "question": [
                {
                    "string": "Did any recent disaster occur in Vietnam on 2023-04-05?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 ?var_2 ?var_3 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation / rdfs:label \"Vietnam\"@en . ?var_1 coy:hasTimestamp ?var_2 . bind ( xsd:date ( ?var_2 ) as ?var_4 ) filter ( ?var_4 = xsd:date ( \"2023-04-05+00:00\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1018",
            "question": [
                {
                    "string": "Was there any active natural disaster in Thailand on 2020-06-15?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 ?var_2 ?var_3 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation / rdfs:label \"Thailand\"@en . ?var_1 coy:hasTimestamp ?var_2 . bind ( xsd:date ( ?var_2 ) as ?var_4 ) filter ( ?var_4 = xsd:date ( \"2020-06-15+00:00\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1019",
            "question": [
                {
                    "string": "Was there an ongoing disaster in Philippines on 2021-07-20?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 ?var_2 ?var_3 where { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasCountryLocation / rdfs:label \"Philippines\"@en . ?var_1 coy:hasTimestamp ?var_2 . bind ( xsd:date ( ?var_2 ) as ?var_4 ) filter ( ?var_4 = xsd:date ( \"2021-07-20+00:00\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1020",
            "question": [
                {
                    "string": "How many companies located in Paris have more than 5000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Paris\" . ?var_1 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 5000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1021",
            "question": [
                {
                    "string": "What is the number of companies headquartered in London with over 20000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"London\" . ?var_1 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 20000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1022",
            "question": [
                {
                    "string": "How many organizations situated in Berlin employ more than 15000 people?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Berlin\" . ?var_1 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 15000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1023",
            "question": [
                {
                    "string": "What is the count of corporations based in Munich having more than 3000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Munich\" . ?var_1 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 3000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1024",
            "question": [
                {
                    "string": "How many firms situated in Madrid exceed 100000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Madrid\" . ?var_1 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 100000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1025",
            "question": [
                {
                    "string": "What is the total number of companies located in Rome with more than 7000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Rome\" . ?var_1 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 7000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1026",
            "question": [
                {
                    "string": "How many enterprises headquartered in Athens have over 25000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Athens\" . ?var_1 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 25000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1027",
            "question": [
                {
                    "string": "What is the number of companies based in Amsterdam with more than 12000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Amsterdam\" . ?var_1 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 12000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1028",
            "question": [
                {
                    "string": "How many organizations situated in Barcelona employ more than 18000 people?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Barcelona\" . ?var_1 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 18000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1029",
            "question": [
                {
                    "string": "What is the count of corporations based in Vienna having more than 8000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Vienna\" . ?var_1 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 8000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1030",
            "question": [
                {
                    "string": "How many firms situated in Stockholm exceed 30000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Stockholm\" . ?var_1 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 30000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1031",
            "question": [
                {
                    "string": "What is the total number of companies located in Dublin with more than 5000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Dublin\" . ?var_1 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 5000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1032",
            "question": [
                {
                    "string": "How many enterprises headquartered in Oslo have over 15000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Oslo\" . ?var_1 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 15000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1033",
            "question": [
                {
                    "string": "What is the number of companies based in Zurich with more than 25000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Zurich\" . ?var_1 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 25000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1034",
            "question": [
                {
                    "string": "How many organizations situated in Lisbon employ more than 7000 people?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Lisbon\" . ?var_1 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 7000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1035",
            "question": [
                {
                    "string": "What is the count of corporations based in Helsinki having more than 10000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Helsinki\" . ?var_1 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 10000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1036",
            "question": [
                {
                    "string": "How many firms situated in Brussels exceed 35000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Brussels\" . ?var_1 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 35000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1037",
            "question": [
                {
                    "string": "What is the total number of companies located in Warsaw with more than 6000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Warsaw\" . ?var_1 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 6000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1038",
            "question": [
                {
                    "string": "How many enterprises headquartered in Budapest have over 20000 employees?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Budapest\" . ?var_1 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 20000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1039",
            "question": [
                {
                    "string": "Are there more corporations in Berlin with a size of \"small\" than \"micro\"?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { { select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Berlin\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"SMALL\" ) } } { select ( count ( distinct ?var_1 ) as ?var_4 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Berlin\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"MICRO\" ) } } filter ( ?var_2 > ?var_4 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1040",
            "question": [
                {
                    "string": "Do more enterprises in Paris have a size of \"small\" compared to \"micro\"?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { { select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Paris\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"SMALL\" ) } } { select ( count ( distinct ?var_1 ) as ?var_4 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Paris\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"MICRO\" ) } } filter ( ?var_2 > ?var_4 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1041",
            "question": [
                {
                    "string": "Are there more firms in Rome with a size of \"small\" than \"micro\"?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { { select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Rome\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"SMALL\" ) } } { select ( count ( distinct ?var_1 ) as ?var_4 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Rome\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"MICRO\" ) } } filter ( ?var_2 > ?var_4 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1042",
            "question": [
                {
                    "string": "Do more organizations in Madrid have a size of \"small\" than \"micro\"?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { { select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Madrid\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"SMALL\" ) } } { select ( count ( distinct ?var_1 ) as ?var_4 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Madrid\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"MICRO\" ) } } filter ( ?var_2 > ?var_4 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1043",
            "question": [
                {
                    "string": "Are there more companies in Vienna with a size of \"small\" than \"micro\"?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { { select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Vienna\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"SMALL\" ) } } { select ( count ( distinct ?var_1 ) as ?var_4 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Vienna\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"MICRO\" ) } } filter ( ?var_2 > ?var_4 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1044",
            "question": [
                {
                    "string": "Do more enterprises in Amsterdam have a size of \"small\" compared to \"micro\"?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { { select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Amsterdam\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"SMALL\" ) } } { select ( count ( distinct ?var_1 ) as ?var_4 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Amsterdam\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"MICRO\" ) } } filter ( ?var_2 > ?var_4 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1045",
            "question": [
                {
                    "string": "Are there more corporations in Barcelona with a size of \"small\" than \"micro\"?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { { select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Barcelona\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"SMALL\" ) } } { select ( count ( distinct ?var_1 ) as ?var_4 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Barcelona\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"MICRO\" ) } } filter ( ?var_2 > ?var_4 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1046",
            "question": [
                {
                    "string": "Do more firms in Stockholm have a size of \"small\" than \"micro\"?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { { select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Stockholm\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"SMALL\" ) } } { select ( count ( distinct ?var_1 ) as ?var_4 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Stockholm\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"MICRO\" ) } } filter ( ?var_2 > ?var_4 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1047",
            "question": [
                {
                    "string": "Are there more organizations in Brussels with a size of \"small\" than \"micro\"?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { { select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Brussels\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"SMALL\" ) } } { select ( count ( distinct ?var_1 ) as ?var_4 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Brussels\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"MICRO\" ) } } filter ( ?var_2 > ?var_4 ) }"
            },
            "answers": [
                ""
            ]
        }
    ]
}