{
    "dataset": {
        "id": "coypu-kg-questions-train"
    },
    "questions": [
        {
            "id": "1633",
            "question": [
                {
                    "string": "Is there an airport in Khost?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Airport . ?var_1 coy:hasCountry \"Afghanistan\" . ?var_1 coy:hasName ?var_2 . filter ( regex ( ?var_2 , \"Khost\" , \"i\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1634",
            "question": [
                {
                    "string": "Is there an airport in Ghazni?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Airport . ?var_1 coy:hasCountry \"Afghanistan\" . ?var_1 coy:hasName ?var_2 . filter ( regex ( ?var_2 , \"Ghazni\" , \"i\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1635",
            "question": [
                {
                    "string": "Is there an airport in Puli Khumri?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Airport . ?var_1 coy:hasCountry \"Afghanistan\" . ?var_1 coy:hasName ?var_2 . filter ( regex ( ?var_2 , \"Puli Khumri\" , \"i\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1637",
            "question": [
                {
                    "string": "Is there an airport in Bamyan?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Airport . ?var_1 coy:hasCountry \"Afghanistan\" . ?var_1 coy:hasName ?var_2 . filter ( regex ( ?var_2 , \"Bamyan\" , \"i\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1638",
            "question": [
                {
                    "string": "Is there an airport in Farah?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Airport . ?var_1 coy:hasCountry \"Afghanistan\" . ?var_1 coy:hasName ?var_2 . filter ( regex ( ?var_2 , \"Farah\" , \"i\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1639",
            "question": [
                {
                    "string": "Is there an airport in Zaranj?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Airport . ?var_1 coy:hasCountry \"Afghanistan\" . ?var_1 coy:hasName ?var_2 . filter ( regex ( ?var_2 , \"Zaranj\" , \"i\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1640",
            "question": [
                {
                    "string": "Is there an airport in Maymana?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Airport . ?var_1 coy:hasCountry \"Afghanistan\" . ?var_1 coy:hasName ?var_2 . filter ( regex ( ?var_2 , \"Maymana\" , \"i\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1641",
            "question": [
                {
                    "string": "Is there an airport in Gardez?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Airport . ?var_1 coy:hasCountry \"Afghanistan\" . ?var_1 coy:hasName ?var_2 . filter ( regex ( ?var_2 , \"Gardez\" , \"i\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1643",
            "question": [
                {
                    "string": "Is there an airport in Pul-e-Alam?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Airport . ?var_1 coy:hasCountry \"Afghanistan\" . ?var_1 coy:hasName ?var_2 . filter ( regex ( ?var_2 , \"Pul-e-Alam\" , \"i\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1644",
            "question": [
                {
                    "string": "Is there an airport in Sar-e Pol?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { ?var_1 rdf:type coy:Airport . ?var_1 coy:hasCountry \"Afghanistan\" . ?var_1 coy:hasName ?var_2 . filter ( regex ( ?var_2 , \"Sar-e Pol\" , \"i\" ) ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1645",
            "question": [
                {
                    "string": "What is the IATA Code of the International Airport in New York?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Airport . ?var_2 rdfs:label \"John F. Kennedy Intl\" . ?var_2 coy:hasId ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1646",
            "question": [
                {
                    "string": "What is the IATA Code of the International Airport in London?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Airport . ?var_2 rdfs:label \"Heathrow Airport\" . ?var_2 coy:hasId ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1647",
            "question": [
                {
                    "string": "What is the IATA Code of the International Airport in Paris?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Airport . ?var_2 rdfs:label \"Charles de Gaulle Airport\" . ?var_2 coy:hasId ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1648",
            "question": [
                {
                    "string": "What is the IATA Code of the International Airport in Tokyo?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Airport . ?var_2 rdfs:label \"Narita International Airport\" . ?var_2 coy:hasId ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1649",
            "question": [
                {
                    "string": "What is the IATA Code of the International Airport in Dubai?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Airport . ?var_2 rdfs:label \"Dubai International Airport\" . ?var_2 coy:hasId ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1650",
            "question": [
                {
                    "string": "What is the IATA Code of the International Airport in Beijing?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Airport . ?var_2 rdfs:label \"Beijing Capital International Airport\" . ?var_2 coy:hasId ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1651",
            "question": [
                {
                    "string": "What is the IATA Code of the International Airport in Hong Kong?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Airport . ?var_2 rdfs:label \"Hong Kong International Airport\" . ?var_2 coy:hasId ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1652",
            "question": [
                {
                    "string": "What is the IATA Code of the International Airport in Shanghai?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Airport . ?var_2 rdfs:label \"Shanghai Pudong International Airport\" . ?var_2 coy:hasId ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1653",
            "question": [
                {
                    "string": "What is the IATA Code of the International Airport in Amsterdam?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Airport . ?var_2 rdfs:label \"Amsterdam Airport Schiphol\" . ?var_2 coy:hasId ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1654",
            "question": [
                {
                    "string": "What is the IATA Code of the International Airport in Singapore?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Airport . ?var_2 rdfs:label \"Singapore Changi Airport\" . ?var_2 coy:hasId ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1655",
            "question": [
                {
                    "string": "What is the IATA Code of the International Airport in Frankfurt?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Airport . ?var_2 rdfs:label \"Frankfurt am Main Airport\" . ?var_2 coy:hasId ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1656",
            "question": [
                {
                    "string": "What is the IATA Code of the International Airport in Seoul?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Airport . ?var_2 rdfs:label \"Incheon International Airport\" . ?var_2 coy:hasId ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1657",
            "question": [
                {
                    "string": "What is the IATA Code of the International Airport in Madrid?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Airport . ?var_2 rdfs:label \"Madrid-Barajas Adolfo Su\u00e1rez Airport\" . ?var_2 coy:hasId ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1658",
            "question": [
                {
                    "string": "What is the IATA Code of the International Airport in Istanbul?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Airport . ?var_2 rdfs:label \"Istanbul Airport\" . ?var_2 coy:hasId ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1659",
            "question": [
                {
                    "string": "What is the IATA Code of the International Airport in Bangkok?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Airport . ?var_2 rdfs:label \"Suvarnabhumi Airport\" . ?var_2 coy:hasId ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1660",
            "question": [
                {
                    "string": "What is the IATA Code of the International Airport in Rome?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Airport . ?var_2 rdfs:label \"Leonardo da Vinci-Fiumicino Airport\" . ?var_2 coy:hasId ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1661",
            "question": [
                {
                    "string": "What is the IATA Code of the International Airport in San Francisco?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Airport . ?var_2 rdfs:label \"San Francisco International Airport\" . ?var_2 coy:hasId ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1662",
            "question": [
                {
                    "string": "What is the IATA Code of the International Airport in Vancouver?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Airport . ?var_2 rdfs:label \"Vancouver International Airport\" . ?var_2 coy:hasId ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1663",
            "question": [
                {
                    "string": "What is the IATA Code of the International Airport in Toronto?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Airport . ?var_2 rdfs:label \"Toronto Pearson International Airport\" . ?var_2 coy:hasId ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1664",
            "question": [
                {
                    "string": "What is the IATA Code of the International Airport in Sydney?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ?var_1 where { ?var_2 rdf:type coy:Airport . ?var_2 rdfs:label \"Sydney Kingsford Smith International Airport\" . ?var_2 coy:hasId ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1665",
            "question": [
                {
                    "string": "How many seaports are located in Asia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Port . ?var_1 coy:hasLocation ?var_3 . ?var_3 coy:hasContinentLocation \"Asia\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1666",
            "question": [
                {
                    "string": "How many seaports are located in Africa?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Port . ?var_1 coy:hasLocation ?var_3 . ?var_3 coy:hasContinentLocation \"Africa\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1667",
            "question": [
                {
                    "string": "How many seaports are located in North America?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Port . ?var_1 coy:hasLocation ?var_3 . ?var_3 coy:hasContinentLocation \"North America\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1668",
            "question": [
                {
                    "string": "How many seaports are located in South America?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Port . ?var_1 coy:hasLocation ?var_3 . ?var_3 coy:hasContinentLocation \"South America\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1669",
            "question": [
                {
                    "string": "How many seaports are located in Oceania?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Port . ?var_1 coy:hasLocation ?var_3 . ?var_3 coy:hasContinentLocation \"Oceania\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1670",
            "question": [
                {
                    "string": "How many seaports are located in Antarctica?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Port . ?var_1 coy:hasLocation ?var_3 . ?var_3 coy:hasContinentLocation \"Antarctica\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1671",
            "question": [
                {
                    "string": "How many seaports are located in the Middle East?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Port . ?var_1 coy:hasLocation ?var_3 . ?var_3 coy:hasContinentLocation \"Middle East\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1672",
            "question": [
                {
                    "string": "How many seaports are located in the Caribbean?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Port . ?var_1 coy:hasLocation ?var_3 . ?var_3 coy:hasContinentLocation \"Caribbean\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1673",
            "question": [
                {
                    "string": "How many seaports are located in the Indian Ocean?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Port . ?var_1 coy:hasLocation ?var_3 . ?var_3 coy:hasContinentLocation \"Indian Ocean\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1674",
            "question": [
                {
                    "string": "How many seaports are located in the Pacific Ocean?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Port . ?var_1 coy:hasLocation ?var_3 . ?var_3 coy:hasContinentLocation \"Pacific Ocean\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1675",
            "question": [
                {
                    "string": "How many seaports are located in the Atlantic Ocean?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Port . ?var_1 coy:hasLocation ?var_3 . ?var_3 coy:hasContinentLocation \"Atlantic Ocean\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1676",
            "question": [
                {
                    "string": "How many seaports are located in the Arctic Ocean?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Port . ?var_1 coy:hasLocation ?var_3 . ?var_3 coy:hasContinentLocation \"Arctic Ocean\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1677",
            "question": [
                {
                    "string": "How many seaports are located in Western Europe?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Port . ?var_1 coy:hasLocation ?var_3 . ?var_3 coy:hasRegionLocation \"Western Europe\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1678",
            "question": [
                {
                    "string": "How many seaports are located in Eastern Europe?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Port . ?var_1 coy:hasLocation ?var_3 . ?var_3 coy:hasRegionLocation \"Eastern Europe\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1679",
            "question": [
                {
                    "string": "How many seaports are located in Northern Europe?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Port . ?var_1 coy:hasLocation ?var_3 . ?var_3 coy:hasRegionLocation \"Northern Europe\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1680",
            "question": [
                {
                    "string": "How many seaports are located in Southern Europe?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Port . ?var_1 coy:hasLocation ?var_3 . ?var_3 coy:hasRegionLocation \"Southern Europe\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1681",
            "question": [
                {
                    "string": "How many seaports are located in Central Europe?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Port . ?var_1 coy:hasLocation ?var_3 . ?var_3 coy:hasRegionLocation \"Central Europe\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1682",
            "question": [
                {
                    "string": "How many seaports are located in Western Asia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Port . ?var_1 coy:hasLocation ?var_3 . ?var_3 coy:hasRegionLocation \"Western Asia\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1683",
            "question": [
                {
                    "string": "How many seaports are located in Eastern Asia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Port . ?var_1 coy:hasLocation ?var_3 . ?var_3 coy:hasRegionLocation \"Eastern Asia\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1684",
            "question": [
                {
                    "string": "How many seaports are located in Southern Asia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Port . ?var_1 coy:hasLocation ?var_3 . ?var_3 coy:hasRegionLocation \"Southern Asia\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1685",
            "question": [
                {
                    "string": "How many seaports are located in Southeastern Asia?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Port . ?var_1 coy:hasLocation ?var_3 . ?var_3 coy:hasRegionLocation \"Southeastern Asia\"@en . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1686",
            "question": [
                {
                    "string": "What capacity does the biggest powerplant in the United States have?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasCountryLocation / rdfs:label \"United States\"@en . ?var_2 coy:hasCapacity ?var_1 } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1687",
            "question": [
                {
                    "string": "What capacity does the biggest powerplant in China have?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasCountryLocation / rdfs:label \"China\"@en . ?var_2 coy:hasCapacity ?var_1 } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1688",
            "question": [
                {
                    "string": "What capacity does the biggest powerplant in India have?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasCountryLocation / rdfs:label \"India\"@en . ?var_2 coy:hasCapacity ?var_1 } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1689",
            "question": [
                {
                    "string": "What capacity does the biggest powerplant in Russia have?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasCountryLocation / rdfs:label \"Russia\"@en . ?var_2 coy:hasCapacity ?var_1 } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1690",
            "question": [
                {
                    "string": "What capacity does the biggest powerplant in Germany have?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasCountryLocation / rdfs:label \"Germany\"@en . ?var_2 coy:hasCapacity ?var_1 } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1691",
            "question": [
                {
                    "string": "What capacity does the biggest powerplant in Brazil have?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasCountryLocation / rdfs:label \"Brazil\"@en . ?var_2 coy:hasCapacity ?var_1 } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1692",
            "question": [
                {
                    "string": "What capacity does the biggest powerplant in Indonesia have?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasCountryLocation / rdfs:label \"Indonesia\"@en . ?var_2 coy:hasCapacity ?var_1 } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1693",
            "question": [
                {
                    "string": "What capacity does the biggest powerplant in France have?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasCountryLocation / rdfs:label \"France\"@en . ?var_2 coy:hasCapacity ?var_1 } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1694",
            "question": [
                {
                    "string": "What capacity does the biggest powerplant in United Kingdom have?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Powerplant . ?var_2 coy:hasCountryLocation / rdfs:label \"United Kingdom\"@en . ?var_2 coy:hasCapacity ?var_1 } order by desc ( ?var_1 ) limit 1"
            },
            "answers": [
                ""
            ]
        }
    ]
}