{
    "dataset": {
        "id": "coypu-kg-questions-train"
    },
    "questions": [
        {
            "id": "1105",
            "question": [
                {
                    "string": "Can you provide the street address of BMW AG?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdfs:label \"BMW AG\" . ?var_2 coy:hasStreet ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1106",
            "question": [
                {
                    "string": "What is the street address of Allianz SE?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdfs:label \"Allianz SE\" . ?var_2 coy:hasStreet ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1107",
            "question": [
                {
                    "string": "Retrieve the street address of Siemens Healthineers AG?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdfs:label \"Siemens Healthineers AG\" . ?var_2 coy:hasStreet ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1108",
            "question": [
                {
                    "string": "Can you provide the street address of Deutsche Telekom AG?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdfs:label \"Deutsche Telekom AG\" . ?var_2 coy:hasStreet ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1109",
            "question": [
                {
                    "string": "What is the street address of SAP SE?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdfs:label \"SAP SE\" . ?var_2 coy:hasStreet ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1110",
            "question": [
                {
                    "string": "Retrieve the street address of Merck KGaA?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdfs:label \"Merck KGaA\" . ?var_2 coy:hasStreet ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1111",
            "question": [
                {
                    "string": "Can you provide the street address of Continental AG?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdfs:label \"Continental AG\" . ?var_2 coy:hasStreet ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1112",
            "question": [
                {
                    "string": "What is the street address of Fresenius SE & Co. KGaA?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdfs:label \"Fresenius SE & Co. KGaA\" . ?var_2 coy:hasStreet ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1113",
            "question": [
                {
                    "string": "Retrieve the street address of ThyssenKrupp AG?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdfs:label \"ThyssenKrupp AG\" . ?var_2 coy:hasStreet ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1114",
            "question": [
                {
                    "string": "Can you provide the street address of Henkel AG & Co. KGaA?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdfs:label \"Henkel AG & Co. KGaA\" . ?var_2 coy:hasStreet ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1115",
            "question": [
                {
                    "string": "What is the street address of Vonovia SE?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdfs:label \"Vonovia SE\" . ?var_2 coy:hasStreet ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1116",
            "question": [
                {
                    "string": "Retrieve the street address of Beiersdorf AG?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdfs:label \"Beiersdorf AG\" . ?var_2 coy:hasStreet ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1117",
            "question": [
                {
                    "string": "Can you provide the street address of Deutsche Post AG?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdfs:label \"Deutsche Post AG\" . ?var_2 coy:hasStreet ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1118",
            "question": [
                {
                    "string": "What is the street address of Brenntag AG?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdfs:label \"Brenntag AG\" . ?var_2 coy:hasStreet ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1119",
            "question": [
                {
                    "string": "Retrieve the street address of Puma SE?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdfs:label \"Puma SE\" . ?var_2 coy:hasStreet ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1120",
            "question": [
                {
                    "string": "What companies are located in the vicinity of Zip Code 78604?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasZip \"78604\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1121",
            "question": [
                {
                    "string": "Which corporations have operations within the area of Zip Code 78604?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasZip \"78604\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1122",
            "question": [
                {
                    "string": "Which enterprises are situated in the vicinity of Zip Code 78604?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasZip \"78604\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1123",
            "question": [
                {
                    "string": "What organizations have presence within the area of Zip Code 78604?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasZip \"78604\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1124",
            "question": [
                {
                    "string": "Which businesses operate in the vicinity of Zip Code 78604?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasZip \"78604\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1125",
            "question": [
                {
                    "string": "What companies are situated in the area of Zip Code 78604?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasZip \"78604\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1126",
            "question": [
                {
                    "string": "Which corporations have offices within the vicinity of Zip Code 78604?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasZip \"78604\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1127",
            "question": [
                {
                    "string": "Which enterprises are located in the vicinity of Zip Code 78604?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasZip \"78604\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1128",
            "question": [
                {
                    "string": "What organizations have establishments within the area of Zip Code 78604?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasZip \"78604\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1129",
            "question": [
                {
                    "string": "Which businesses are based in the vicinity of Zip Code 78604?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasZip \"78604\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1130",
            "question": [
                {
                    "string": "What companies operate within the area of Zip Code 78604?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasZip \"78604\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1131",
            "question": [
                {
                    "string": "Which corporations are situated in the vicinity of Zip Code 78604?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasZip \"78604\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1132",
            "question": [
                {
                    "string": "Which enterprises have presence within the area of Zip Code 78604?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasZip \"78604\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1133",
            "question": [
                {
                    "string": "What organizations are located in the vicinity of Zip Code 78604?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasZip \"78604\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1134",
            "question": [
                {
                    "string": "Which businesses have offices within the area of Zip Code 78604?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasZip \"78604\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1135",
            "question": [
                {
                    "string": "What companies are based in the vicinity of Zip Code 78604?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasZip \"78604\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1136",
            "question": [
                {
                    "string": "Which corporations operate within the area of Zip Code 78604?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasZip \"78604\" . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1140",
            "question": [
                {
                    "string": "How many disasters have occurred in India since 2023-01-01?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT (COUNT(DISTINCT ?var_1) AS ?var_2) WHERE { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasTimestamp ?var_3 . ?var_1 coy:hasCountryLocation / rdfs:label \"India\"@en . FILTER(YEAR(xsd:dateTime(?var_3)) >= 2023) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1141",
            "question": [
                {
                    "string": "How many incidents have taken place in Japan since 2022-10-01?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT (COUNT(DISTINCT ?var_1) AS ?var_2) WHERE { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasTimestamp ?var_3 . ?var_1 coy:hasCountryLocation / rdfs:label \"Japan\"@en . FILTER(YEAR(xsd:dateTime(?var_3)) >= 2022) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1142",
            "question": [
                {
                    "string": "How many emergencies have unfolded in Brazil since 2022-12-01?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT (COUNT(DISTINCT ?var_1) AS ?var_2) WHERE { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasTimestamp ?var_3 . ?var_1 coy:hasCountryLocation / rdfs:label \"Brazil\"@en . FILTER(YEAR(xsd:dateTime(?var_3)) >= 2022) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1143",
            "question": [
                {
                    "string": "How many calamities have struck in China since 2022-09-01?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT (COUNT(DISTINCT ?var_1) AS ?var_2) WHERE { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasTimestamp ?var_3 . ?var_1 coy:hasCountryLocation / rdfs:label \"China\"@en . FILTER(YEAR(xsd:dateTime(?var_3)) >= 2022) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1144",
            "question": [
                {
                    "string": "How many catastrophes have happened in United States since 2022-08-01?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT (COUNT(DISTINCT ?var_1) AS ?var_2) WHERE { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasTimestamp ?var_3 . ?var_1 coy:hasCountryLocation / rdfs:label \"United States\"@en . FILTER(YEAR(xsd:dateTime(?var_3)) >= 2022) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1145",
            "question": [
                {
                    "string": "How many tragedies have occurred in Germany since 2022-11-01?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT (COUNT(DISTINCT ?var_1) AS ?var_2) WHERE { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasTimestamp ?var_3 . ?var_1 coy:hasCountryLocation / rdfs:label \"Germany\"@en . FILTER(YEAR(xsd:dateTime(?var_3)) >= 2022) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1146",
            "question": [
                {
                    "string": "How many mishaps have taken place in France since 2023-03-01?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT (COUNT(DISTINCT ?var_1) AS ?var_2) WHERE { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasTimestamp ?var_3 . ?var_1 coy:hasCountryLocation / rdfs:label \"France\"@en . FILTER(YEAR(xsd:dateTime(?var_3)) >= 2023) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1147",
            "question": [
                {
                    "string": "How many occurrences have unfolded in Russia since 2023-02-01?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT (COUNT(DISTINCT ?var_1) AS ?var_2) WHERE { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasTimestamp ?var_3 . ?var_1 coy:hasCountryLocation / rdfs:label \"Russia\"@en . FILTER(YEAR(xsd:dateTime(?var_3)) >= 2023) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1148",
            "question": [
                {
                    "string": "How many incidents have taken place in Italy since 2023-01-01?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT (COUNT(DISTINCT ?var_1) AS ?var_2) WHERE { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasTimestamp ?var_3 . ?var_1 coy:hasCountryLocation / rdfs:label \"Italy\"@en . FILTER(YEAR(xsd:dateTime(?var_3)) >= 2023) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1149",
            "question": [
                {
                    "string": "How many calamities have struck in Spain since 2023-04-01?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT (COUNT(DISTINCT ?var_1) AS ?var_2) WHERE { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasTimestamp ?var_3 . ?var_1 coy:hasCountryLocation / rdfs:label \"Spain\"@en . FILTER(YEAR(xsd:dateTime(?var_3)) >= 2023) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1150",
            "question": [
                {
                    "string": "How many catastrophes have happened in United Kingdom since 2023-05-01?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT (COUNT(DISTINCT ?var_1) AS ?var_2) WHERE { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasTimestamp ?var_3 . ?var_1 coy:hasCountryLocation / rdfs:label \"United Kingdom\"@en . FILTER(YEAR(xsd:dateTime(?var_3)) >= 2023) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1151",
            "question": [
                {
                    "string": "How many crises have occurred in Canada since 2023-06-01?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT (COUNT(DISTINCT ?var_1) AS ?var_2) WHERE { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasTimestamp ?var_3 . ?var_1 coy:hasCountryLocation / rdfs:label \"Canada\"@en . FILTER(YEAR(xsd:dateTime(?var_3)) >= 2023) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1152",
            "question": [
                {
                    "string": "How many mishaps have taken place in Mexico since 2023-07-01?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT (COUNT(DISTINCT ?var_1) AS ?var_2) WHERE { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasTimestamp ?var_3 . ?var_1 coy:hasCountryLocation / rdfs:label \"Mexico\"@en . FILTER(YEAR(xsd:dateTime(?var_3)) >= 2023) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1153",
            "question": [
                {
                    "string": "How many occurrences have unfolded in Argentina since 2023-08-01?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT (COUNT(DISTINCT ?var_1) AS ?var_2) WHERE { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasTimestamp ?var_3 . ?var_1 coy:hasCountryLocation / rdfs:label \"Argentina\"@en . FILTER(YEAR(xsd:dateTime(?var_3)) >= 2023) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1154",
            "question": [
                {
                    "string": "How many incidents have taken place in South Africa since 2023-09-01?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT (COUNT(DISTINCT ?var_1) AS ?var_2) WHERE { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasTimestamp ?var_3 . ?var_1 coy:hasCountryLocation / rdfs:label \"South Africa\"@en . FILTER(YEAR(xsd:dateTime(?var_3)) >= 2023) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1155",
            "question": [
                {
                    "string": "How many calamities have struck in Nigeria since 2023-10-01?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT (COUNT(DISTINCT ?var_1) AS ?var_2) WHERE { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasTimestamp ?var_3 . ?var_1 coy:hasCountryLocation / rdfs:label \"Nigeria\"@en . FILTER(YEAR(xsd:dateTime(?var_3)) >= 2023) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1156",
            "question": [
                {
                    "string": "How many catastrophes have happened in Australia since 2023-11-01?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT (COUNT(DISTINCT ?var_1) AS ?var_2) WHERE { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasTimestamp ?var_3 . ?var_1 coy:hasCountryLocation / rdfs:label \"Australia\"@en . FILTER(YEAR(xsd:dateTime(?var_3)) >= 2023) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1157",
            "question": [
                {
                    "string": "How many crises have occurred in India since 2024-01-01?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT (COUNT(DISTINCT ?var_1) AS ?var_2) WHERE { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasTimestamp ?var_3 . ?var_1 coy:hasCountryLocation / rdfs:label \"India\"@en . FILTER(YEAR(xsd:dateTime(?var_3)) >= 2024) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1158",
            "question": [
                {
                    "string": "How many mishaps have taken place in Japan since 2024-02-01?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT (COUNT(DISTINCT ?var_1) AS ?var_2) WHERE { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasTimestamp ?var_3 . ?var_1 coy:hasCountryLocation / rdfs:label \"Japan\"@en . FILTER(YEAR(xsd:dateTime(?var_3)) >= 2024) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1159",
            "question": [
                {
                    "string": "How many occurrences have unfolded in Brazil since 2024-03-01?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "SELECT (COUNT(DISTINCT ?var_1) AS ?var_2) WHERE { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasTimestamp ?var_3 . ?var_1 coy:hasCountryLocation / rdfs:label \"Brazil\"@en . FILTER(YEAR(xsd:dateTime(?var_3)) >= 2024) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1160",
            "question": [
                {
                    "string": "Did a disaster occur in 2023 that affected both France and Italy simultaneously?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ASK { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation ?var_3 , ?var_4 . ?var_3 rdf:type coy:Country . ?var_3 rdfs:label \"France\"@en . ?var_4 rdf:type coy:Country . ?var_4 skos:altLabel \"Italy\"@en . FILTER(YEAR(?var_2) = 2023) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1161",
            "question": [
                {
                    "string": "Was there a crisis in 2024 that impacted both Spain and Portugal simultaneously?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ASK { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation ?var_3 , ?var_4 . ?var_3 rdf:type coy:Country . ?var_3 rdfs:label \"Spain\"@en . ?var_4 rdf:type coy:Country . ?var_4 skos:altLabel \"Portugal\"@en . FILTER(YEAR(?var_2) = 2024) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1162",
            "question": [
                {
                    "string": "Did an emergency happen in 2022 that struck both United States and Canada at the same time?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ASK { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation ?var_3 , ?var_4 . ?var_3 rdf:type coy:Country . ?var_3 rdfs:label \"United States\"@en . ?var_4 rdf:type coy:Country . ?var_4 skos:altLabel \"Canada\"@en . FILTER(YEAR(?var_2) = 2022) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1163",
            "question": [
                {
                    "string": "Was there a calamity in 2025 that affected both Australia and New Zealand simultaneously?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ASK { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation ?var_3 , ?var_4 . ?var_3 rdf:type coy:Country . ?var_3 rdfs:label \"Australia\"@en . ?var_4 rdf:type coy:Country . ?var_4 skos:altLabel \"New Zealand\"@en . FILTER(YEAR(?var_2) = 2025) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1164",
            "question": [
                {
                    "string": "Did a catastrophe occur in 2026 that impacted both United Kingdom and Ireland simultaneously?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ASK { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation ?var_3 , ?var_4 . ?var_3 rdf:type coy:Country . ?var_3 rdfs:label \"United Kingdom\"@en . ?var_4 rdf:type coy:Country . ?var_4 skos:altLabel \"Ireland\"@en . FILTER(YEAR(?var_2) = 2026) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1165",
            "question": [
                {
                    "string": "Did a tragedy happen in 2027 that struck both Japan and South Korea simultaneously?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ASK { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation ?var_3 , ?var_4 . ?var_3 rdf:type coy:Country . ?var_3 rdfs:label \"Japan\"@en . ?var_4 rdf:type coy:Country . ?var_4 skos:altLabel \"South Korea\"@en . FILTER(YEAR(?var_2) = 2027) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1166",
            "question": [
                {
                    "string": "Did an incident happen in 2028 that affected both Brazil and Argentina at the same time?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ASK { ?var_1 rdf:type coy:Disaster . ?var_1 coy:hasStartDate ?var_2 . ?var_1 coy:hasCountryLocation ?var_3 , ?var_4 . ?var_3 rdf:type coy:Country . ?var_3 rdfs:label \"Brazil\"@en . ?var_4 rdf:type coy:Country . ?var_4 skos:altLabel \"Argentina\"@en . FILTER(YEAR(?var_2) = 2028) }"
            },
            "answers": [
                ""
            ]
        }
    ]
}