{
    "dataset": {
        "id": "coypu-kg-questions-train"
    },
    "questions": [
        {
            "id": "1048",
            "question": [
                {
                    "string": "Do more companies in Copenhagen have a size of \"small\" compared to \"micro\"?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { { select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Copenhagen\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"SMALL\" ) } } { select ( count ( distinct ?var_1 ) as ?var_4 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Copenhagen\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"MICRO\" ) } } filter ( ?var_2 > ?var_4 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1049",
            "question": [
                {
                    "string": "Are there more enterprises in Oslo with a size of \"small\" than \"micro\"?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { { select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Oslo\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"SMALL\" ) } } { select ( count ( distinct ?var_1 ) as ?var_4 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Oslo\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"MICRO\" ) } } filter ( ?var_2 > ?var_4 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1050",
            "question": [
                {
                    "string": "Do more corporations in Zurich have a size of \"small\" than \"micro\"?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { { select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Zurich\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"SMALL\" ) } } { select ( count ( distinct ?var_1 ) as ?var_4 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Zurich\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"MICRO\" ) } } filter ( ?var_2 > ?var_4 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1051",
            "question": [
                {
                    "string": "Are there more companies in Budapest with a size of \"small\" than \"micro\"?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { { select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Budapest\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"SMALL\" ) } } { select ( count ( distinct ?var_1 ) as ?var_4 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Budapest\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"MICRO\" ) } } filter ( ?var_2 > ?var_4 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1052",
            "question": [
                {
                    "string": "Do more enterprises in Helsinki have a size of \"small\" compared to \"micro\"?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { { select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Helsinki\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"SMALL\" ) } } { select ( count ( distinct ?var_1 ) as ?var_4 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Helsinki\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"MICRO\" ) } } filter ( ?var_2 > ?var_4 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1053",
            "question": [
                {
                    "string": "Are there more corporations in Warsaw with a size of \"small\" than \"micro\"?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { { select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Warsaw\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"SMALL\" ) } } { select ( count ( distinct ?var_1 ) as ?var_4 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Warsaw\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"MICRO\" ) } } filter ( ?var_2 > ?var_4 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1054",
            "question": [
                {
                    "string": "Do more firms in Lisbon have a size of \"small\" than \"micro\"?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { { select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Lisbon\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"SMALL\" ) } } { select ( count ( distinct ?var_1 ) as ?var_4 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Lisbon\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"MICRO\" ) } } filter ( ?var_2 > ?var_4 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1055",
            "question": [
                {
                    "string": "Are there more organizations in Dublin with a size of \"small\" than \"micro\"?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "ask { { select ( count ( distinct ?var_1 ) as ?var_2 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Dublin\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"SMALL\" ) } } { select ( count ( distinct ?var_1 ) as ?var_4 ) where { ?var_1 rdf:type coy:Company . ?var_1 coy:hasCity \"Dublin\" . ?var_1 coy:hasCompanySize ?var_3 . filter ( ?var_3 = \"MICRO\" ) } } filter ( ?var_2 > ?var_4 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1061",
            "question": [
                {
                    "string": "What is the URL of the largest corporation (by number of employees) headquartered in Berlin?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCity \"Berlin\" . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasUrl ?var_1 } order by desc ( xsd:integer ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1062",
            "question": [
                {
                    "string": "What is the website of the biggest organization (by number of employees) located in Paris?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCity \"Paris\" . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasUrl ?var_1 } order by desc ( xsd:integer ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1063",
            "question": [
                {
                    "string": "What is the web address of the largest enterprise (by number of employees) based in Rome?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCity \"Rome\" . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasUrl ?var_1 } order by desc ( xsd:integer ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1064",
            "question": [
                {
                    "string": "What is the URL of the biggest company (by number of employees) located in Madrid?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCity \"Madrid\" . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasUrl ?var_1 } order by desc ( xsd:integer ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1065",
            "question": [
                {
                    "string": "What is the website of the largest corporation (by number of employees) headquartered in Vienna?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCity \"Vienna\" . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasUrl ?var_1 } order by desc ( xsd:integer ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1066",
            "question": [
                {
                    "string": "What is the web address of the biggest organization (by number of employees) based in Amsterdam?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCity \"Amsterdam\" . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasUrl ?var_1 } order by desc ( xsd:integer ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1067",
            "question": [
                {
                    "string": "What is the URL of the largest enterprise (by number of employees) located in Barcelona?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCity \"Barcelona\" . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasUrl ?var_1 } order by desc ( xsd:integer ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1068",
            "question": [
                {
                    "string": "What is the website of the biggest company (by number of employees) situated in Stockholm?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCity \"Stockholm\" . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasUrl ?var_1 } order by desc ( xsd:integer ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1069",
            "question": [
                {
                    "string": "What is the web address of the largest corporation (by number of employees) based in Brussels?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCity \"Brussels\" . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasUrl ?var_1 } order by desc ( xsd:integer ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1070",
            "question": [
                {
                    "string": "What is the URL of the biggest organization (by number of employees) headquartered in Copenhagen?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCity \"Copenhagen\" . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasUrl ?var_1 } order by desc ( xsd:integer ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1071",
            "question": [
                {
                    "string": "What is the website of the largest enterprise (by number of employees) based in Oslo?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCity \"Oslo\" . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasUrl ?var_1 } order by desc ( xsd:integer ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1072",
            "question": [
                {
                    "string": "What is the web address of the biggest company (by number of employees) located in Zurich?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCity \"Zurich\" . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasUrl ?var_1 } order by desc ( xsd:integer ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1073",
            "question": [
                {
                    "string": "What is the URL of the largest corporation (by number of employees) headquartered in Budapest?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCity \"Budapest\" . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasUrl ?var_1 } order by desc ( xsd:integer ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1074",
            "question": [
                {
                    "string": "What is the website of the biggest organization (by number of employees) based in Helsinki?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCity \"Helsinki\" . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasUrl ?var_1 } order by desc ( xsd:integer ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1075",
            "question": [
                {
                    "string": "What is the web address of the biggest enterprise (by number of employees) located in Warsaw?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCity \"Warsaw\" . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasUrl ?var_1 } order by desc ( xsd:integer ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1076",
            "question": [
                {
                    "string": "What is the URL of the largest company (by number of employees) situated in Lisbon?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCity \"Lisbon\" . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasUrl ?var_1 } order by desc ( xsd:integer ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1077",
            "question": [
                {
                    "string": "What is the website of the biggest corporation (by number of employees) headquartered in Dublin?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCity \"Dublin\" . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasUrl ?var_1 } order by desc ( xsd:integer ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1078",
            "question": [
                {
                    "string": "What is the web address of the biggest organization (by number of employees) based in Copenhagen?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCity \"Copenhagen\" . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasUrl ?var_1 } order by desc ( xsd:integer ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1079",
            "question": [
                {
                    "string": "What is the URL of the largest enterprise (by number of employees) located in Oslo?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasCity \"Oslo\" . ?var_2 coy:hasNumberOfEmployees ?var_3 . ?var_2 coy:hasUrl ?var_1 } order by desc ( xsd:integer ( ?var_3 ) ) limit 1"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1080",
            "question": [
                {
                    "string": "Retrieve the EBID-Code of all corporations having over 150,000 employees.",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasEbidCode ?var_1 . ?var_2 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 150000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1081",
            "question": [
                {
                    "string": "List the EBID-Code of companies with more than 200,000 employees.",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasEbidCode ?var_1 . ?var_2 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 200000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1082",
            "question": [
                {
                    "string": "Obtain the EBID-Code of all enterprises having a workforce of over 120,000 employees.",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasEbidCode ?var_1 . ?var_2 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 120000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1083",
            "question": [
                {
                    "string": "Get the EBID-Code of all organizations with more than 180,000 employees.",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasEbidCode ?var_1 . ?var_2 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 180000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1084",
            "question": [
                {
                    "string": "Retrieve the EBID-Code of all companies having over 250,000 employees.",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasEbidCode ?var_1 . ?var_2 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 250000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1085",
            "question": [
                {
                    "string": "List the EBID-Code of companies with more than 300,000 employees.",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasEbidCode ?var_1 . ?var_2 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 300000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1086",
            "question": [
                {
                    "string": "Obtain the EBID-Code of all enterprises having a workforce of over 170,000 employees.",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasEbidCode ?var_1 . ?var_2 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 170000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1087",
            "question": [
                {
                    "string": "Get the EBID-Code of all organizations with more than 220,000 employees.",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasEbidCode ?var_1 . ?var_2 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 220000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1088",
            "question": [
                {
                    "string": "Retrieve the EBID-Code of all companies having over 350,000 employees.",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasEbidCode ?var_1 . ?var_2 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 350000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1089",
            "question": [
                {
                    "string": "List the EBID-Code of companies with more than 400,000 employees.",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasEbidCode ?var_1 . ?var_2 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 400000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1090",
            "question": [
                {
                    "string": "Obtain the EBID-Code of all enterprises having a workforce of over 280,000 employees.",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasEbidCode ?var_1 . ?var_2 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 280000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1091",
            "question": [
                {
                    "string": "Get the EBID-Code of all organizations with more than 320,000 employees.",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasEbidCode ?var_1 . ?var_2 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 320000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1092",
            "question": [
                {
                    "string": "Retrieve the EBID-Code of all companies having over 450,000 employees.",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasEbidCode ?var_1 . ?var_2 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 450000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1093",
            "question": [
                {
                    "string": "List the EBID-Code of companies with more than 500,000 employees.",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasEbidCode ?var_1 . ?var_2 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 500000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1094",
            "question": [
                {
                    "string": "Obtain the EBID-Code of all enterprises having a workforce of over 380,000 employees.",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasEbidCode ?var_1 . ?var_2 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 380000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1095",
            "question": [
                {
                    "string": "Get the EBID-Code of all organizations with more than 420,000 employees.",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasEbidCode ?var_1 . ?var_2 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 420000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1096",
            "question": [
                {
                    "string": "Retrieve the EBID-Code of all companies having over 550,000 employees.",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasEbidCode ?var_1 . ?var_2 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 550000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1097",
            "question": [
                {
                    "string": "List the EBID-Code of companies with more than 600,000 employees.",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasEbidCode ?var_1 . ?var_2 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 600000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1098",
            "question": [
                {
                    "string": "Obtain the EBID-Code of all enterprises having a workforce of over 480,000 employees.",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasEbidCode ?var_1 . ?var_2 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 480000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1099",
            "question": [
                {
                    "string": "Get the EBID-Code of all organizations with more than 520,000 employees.",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdf:type coy:Company . ?var_2 coy:hasEbidCode ?var_1 . ?var_2 coy:hasNumberOfEmployees ?var_3 . filter ( xsd:integer ( ?var_3 ) > 520000 ) }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1100",
            "question": [
                {
                    "string": "What is the street address of Siemens AG?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdfs:label \"Siemens AG\" . ?var_2 coy:hasStreet ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1101",
            "question": [
                {
                    "string": "Retrieve the street address of Bayer AG?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdfs:label \"Bayer AG\" . ?var_2 coy:hasStreet ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1102",
            "question": [
                {
                    "string": "Can you provide the street address of Volkswagen AG?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdfs:label \"Volkswagen AG\" . ?var_2 coy:hasStreet ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1103",
            "question": [
                {
                    "string": "What is the street address of Daimler AG?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdfs:label \"Daimler AG\" . ?var_2 coy:hasStreet ?var_1 . }"
            },
            "answers": [
                ""
            ]
        },
        {
            "id": "1104",
            "question": [
                {
                    "string": "Retrieve the street address of BASF SE?",
                    "language": "en"
                }
            ],
            "query": {
                "sparql": "select distinct ?var_1 where { ?var_2 rdfs:label \"BASF SE\" . ?var_2 coy:hasStreet ?var_1 . }"
            },
            "answers": [
                ""
            ]
        }
    ]
}